//  localstorage
//  wpm_sum, wpm_times, average_wpm
//  acc_sum, acc_times, average_acc
//  tctc2.0-saved_difficulty            選擇難度
//  username, email, intro


const Level_Data = {
    easy : {
        chapter:[
            {
                id : "1-1",
                name :"1-1 認識鍵盤",
                stage :[
                    {id : "1-1-1", name:"認識鍵盤佈局", name2:"" , type:"基本介紹", level:"☆☆☆☆☆☆☆", target: ""},            //target: 15字元 正常螢幕一排
                    {id : "1-1-2", name:"認識繁體中文鍵盤", name2:"", type:"基本介紹", level:"☆☆☆☆☆☆☆", target:""},
                    {id : "1-1-3", name:"打字指法", name2:"", type:"基本介紹", level:"☆☆☆☆☆☆☆", target:""}
                ]
            },
            {
                id : "1-2",
                name : "1-2 標點符號",
                stage:[
                    {id:"1-2-1", name:"基礎符號", name2:" _  ˊ" ,name3:"二聲請使用左手食指 空白鍵建議使用右手拇指", type:"注音練習", level:"☆☆☆☆☆☆★", target:" ˊ ˊ ˊˊ  ˊˊˊ  "},
                    {id:"1-2-2", name:"階段驗收", name2:" _ ˊ" ,name3:"二聲請使用左手食指 空白鍵建議使用右手拇指", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ˊˊ  ˊˊˊ   ˊ  ˊ ˊˊ  ˊˊ  ˊˊ ˊˊ"},
                    {id:"1-2-3", name:"基礎符號", name2:" ˇ ˋ" ,name3:"此關僅限使用左手（空白鍵除外）", type:"注音練習", level:"☆☆☆☆☆★★", target:"ˇ  ˋ  ˇˇˋ ˋˋˇ ˇˋ ˋˇ ˇˋ ˋˋˇ ˇˇˋ"},
                    {id:"1-2-4", name:"階段驗收", name2:" _  ˊ ˇ ˋ" , name3:"正確的指法 + 頻繁的練習 + 不看鍵盤 = 提升速度關鍵！！", type:"注音練習", level:"☆☆☆☆☆★★", target:" ˊˇˋ ˋˇˊ  ˇ ˋ ˊ ˇˋ ˊˋ ˊˇ ˋˊ ˇˋ"},
                    {id:"1-2-5", name:"階段驗收", name2:" ˙ ↵" , name3:"此關僅限使用右手", type:"注音練習", level:"☆☆☆☆☆★★", target:"˙ ↵ ˙↵ ↵˙ ↵↵˙˙ ↵↵˙ ˙˙↵ ˙˙↵ ↵↵˙"},
                    {id:"1-2-6", name:"階段驗收", name2:" _  ˊ ˇ ˋ ˙ ↵" , name3:"↵ 為 Enter", type:"注音練習", level:"☆☆☆☆☆★★", target:" ˊˇˋ˙↵ ˇˋˊ˙↵ ↵↵ˇ ˋˋˊ ˙˙ˇ ↵ˇˋ ˊ˙ˋ ˋˇˊ ↵ˇˊ ˊˋˇ↵"},

                    {id:"1-2-7", name:"章節驗收", name2:" - 1-2" , name3:"恭喜來到章節尾聲 趕快完成此章節吧", type:"注音練習", level:"☆☆☆☆☆★★", target:"ˊˇˋ˙↵ ˇˋˋ ˙ˇ↵ ˙ˇˋ ↵˙ˊ ˊˇˋ ↵↵ˊ ˊˊˋ ˋˋˇ ˇˇ↵ ↵˙˙"}

                ]
            },
            {
                id : "1-3",
                name : "1-3 食指-1",
                stage:[
                    {id:"1-3-1", name:"基礎注音", name2:" ㄑ ㄨ" , name3:"雙手食指記得隨時要回到起始點喔（ㄑ ㄨ）", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ㄑㄑ ㄨㄨ ㄑㄨ ㄨㄑ ㄑㄑㄨ ㄨㄨㄑ ㄨˊ ㄨˇ ㄨˋ ↵"},
                    {id:"1-3-2", name:"基礎注音", name2:" ㄕ ㄘ" , name3:"基礎一定要打好 保持不看鍵盤的好習慣 將來才會快～～", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ㄕㄕ ㄘㄘ ㄕㄘ ㄘㄕ ㄕ ㄘ ㄕㄘㄕ ㄘㄕㄘ ㄕㄕㄘ ㄘㄘ"},
                    {id:"1-3-3", name:"階段驗收", name2:" ㄑ ㄨ ㄕ ㄘ" , name3:"來驗收囉～看看你的學習成果如何吧", type:"注音練習", level:"☆☆☆☆☆★★", target:"ㄑㄨ ㄕㄘ ㄨㄑ ㄘㄕ ㄑㄕ ㄨㄘ ㄕㄑ ㄘㄨ ㄑㄨㄕ ㄘㄨㄑ ㄕㄘㄨ ㄑㄕㄘ ㄨㄑㄕㄘ↵"},

                    {id:"1-3-4", name:"基礎注音", name2:" ㄐ ㄧ" , name3:"正確的指法 + 頻繁的練習 + 不看鍵盤 = 提升速度關鍵！！", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ㄐㄐ ㄧㄧ ㄐㄧ ㄧㄐ ㄐ ㄧ ㄐㄧㄐ ㄧㄐㄧ ㄐㄐㄧ ㄧ↵"},
                    {id:"1-3-5", name:"基礎注音", name2:" ㄒ ㄙ" , name3:"", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ㄒㄒ ㄙㄙ ㄒㄙ ㄙㄒ ㄒ ㄙ ㄒㄙㄒ ㄙㄒㄙ ㄒㄒㄙ ㄙ↵"},
                    {id:"1-3-6", name:"階段驗收", name2:" ㄐ ㄧ ㄒ ㄙ" , name3:"", type:"注音練習", level:"☆☆☆☆☆★★", target:"ㄐㄧ ㄒㄙ ㄧㄐ ㄙㄒ ㄐㄒ ㄧㄙ ㄒㄐ ㄙㄧ ㄐㄧㄒ ㄙㄧㄐ ㄒㄙㄧ ㄐㄒㄙ ㄧㄐㄒㄙ↵"},

                    {id:"1-3-7", name:"章節驗收", name2:" - 1-3" , name3:"", type:"注音練習", level:"☆☆☆☆☆★★", target:"ㄑ ㄨ ㄕ ㄘ ㄐ ㄧ ㄒ ㄙ ㄕㄨˊ ㄑㄧˇ ㄒㄧˇ ㄐㄧˇ ㄨˇ ㄕˋ ㄙˋ ㄕˇ ㄐㄧㄧ ㄧㄨㄨ ㄨㄙㄙ ㄙㄒㄒ ㄒㄑㄑ ㄑㄕㄕ ㄕㄘㄘ ㄘㄐㄐ"}

                ]
            },
            {
                id : "1-4",
                name : "1-4 食指-2",
                stage:[
                    {id:"1-4-1", name:"基礎注音", name2:" ㄏ ㄩ" , name3:"先求準 再求快！！", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ㄏㄏ ㄩㄩ ㄏㄩ ㄩㄏ ㄏ ㄩ ㄏㄩㄏ ㄩㄏㄩ ㄏㄏㄩ ㄩ↵"},
                    {id:"1-4-2", name:"基礎注音", name2:" ㄔ ㄗ" , name3:"", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ㄔㄔ ㄗㄗ ㄔㄗ ㄗㄔ ㄔ ㄗ ㄔㄗㄔ ㄗㄔㄗ ㄔㄔㄗ ㄗ↵"},
                    {id:"1-4-3", name:"階段驗收", name2:" ㄏ ㄩ ㄔ ㄗ" , name3:"", type:"注音練習", level:"☆☆☆☆☆★★", target:"ㄏ ㄩ ㄔ ㄗ ㄏㄩ ㄔㄗ↵ ㄔˊ ㄔˇ ㄔˋ ㄩˊ ㄩˇ ㄩˋ ㄗˇ ㄗˋ ㄗ˙ ㄩㄏ ㄗㄔ ㄏㄏ ㄩㄩ ㄔㄔ ㄗㄗ↵"},
                    {id:"1-4-4", name:"基礎注音", name2:" ㄖ" , name3:"", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ㄖ ㄖㄖ ㄖㄖㄖ ㄖ ㄖˊ ㄖˇ ㄖˋ ㄖ˙ ㄖㄖ ㄖㄖ ↵"},
                    {id:"1-4-5", name:"階段驗收", name2:" ㄏ ㄩ ㄔ ㄗ ㄖ" , name3:"內容越來越多 一定要把之前的課程都複習熟喔！", type:"注音練習", level:"☆☆☆☆☆★★", target:"ㄏ ㄩ ㄔ ㄗ ㄖ ㄏㄩㄏ ㄩㄔㄩ ㄔㄗㄔ ㄗㄖㄗ ㄖㄏㄖ ㄖˋ ㄔˋ ㄗˋ ㄩˋ ㄏㄨˋ ㄐㄧˊ ㄐㄧˇ ㄙˋ ㄒㄧˇ"},
                    {id:"1-4-6", name:"章節驗收", name2:" - 1-4" , name3:"只要頻繁訓練 就能在眾人中脫穎而出！", type:"注音練習", level:"☆☆☆☆☆★★", target:"ㄔㄨ ㄕㄨ ↵ ㄗˋ ㄘˊ↵ ㄗㄨ ㄨ ↵ ㄕㄨ ㄏㄨ↵ ㄕㄨˇ ㄕㄨˋ↵ ㄔˇ ㄗ˙↵ ㄔㄨ ㄑㄩˋ↵ ㄙˋㄕˊㄨˇ↵ ㄕˊㄧ ↵ㄐㄧ ㄩˊ↵ㄕˋ↵"}
                ]
                
                
            },
            {
                id : "1-5",
                name : "1-5 中指",
                stage:[
                    {id:"1-5-1", name:"基礎注音", name2:" ㄎ ㄜ" , name3:"注意不要用食指按喔 指法最重要", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ㄎㄜ ㄎㄜˊ ㄎㄜˇ ㄎㄜˋ ↵ ㄎㄎㄜ ㄜㄎㄎ ㄜㄎㄜㄎ↵"},
                    {id:"1-5-2", name:"階段驗收", name2:" ㄎ ㄜ" , name3:"準確率永遠大於速度", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ㄎㄎㄜ ㄜㄎㄎ ㄎㄜ ㄎㄜˇ ㄎㄜˋ ㄎㄜˊ ㄎㄜ˙ ㄜㄜㄎ ㄎㄎㄜ ㄜㄜㄎㄎ ㄎㄎㄜㄜ↵"},
                    {id:"1-5-3", name:"基礎注音", name2:" ㄌ ㄝ" , name3:"記得兩手食指放到基準點上 打ㄌ ㄝ時 中指 輕輕往下彎", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ㄌㄝ ㄝㄌ ㄌㄌㄝ ㄝㄝㄌ ㄌㄝㄌㄝ ㄌㄝㄌㄝ ㄝˊ ㄝˋ↵"},
                    {id:"1-5-4", name:"階段驗收", name2:" ㄎ ㄜ ㄌ ㄝ" , name3:"先練準 再練快", type:"注音練習", level:"☆☆☆☆☆★★", target:"ㄎ ㄜ ㄌ ㄝ ㄌㄜ ㄌㄜˊ ㄌㄜˇ ㄌㄜˋ ㄜ ㄜˊ↵ ㄜˇ ㄜˋ ㄎㄜ ㄎㄜˊ↵ ㄎㄜˇ ㄎㄜˋ ㄌㄝㄝ ㄝㄜㄜ ㄜㄎㄎ ㄎㄌㄌ↵"},
                    {id:"1-5-5", name:"基礎注音", name2:" ㄍ ㄛ" , name3:"", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ㄍ ㄛ ㄍㄍㄛ ㄛㄍㄍ ㄍㄛ ㄍㄛ ㄛㄍㄍ ㄍㄛㄛ ㄍㄛ ㄍㄛˊ ㄍㄛˇ ㄍㄛˋ ㄍㄜ˙↵"},
                    {id:"1-5-6", name:"階段驗收", name2:" ㄎ ㄜ ㄌ ㄝ ㄍ ㄛ" , name3:"", type:"注音練習", level:"☆☆☆☆☆★★", target:"ㄎ ㄜ ㄌ ㄝ ㄍ ㄛ ㄎㄜㄜ ㄜㄛㄛ ㄜㄍㄍ ㄍㄎㄎ ㄎㄌㄌ ㄎㄝㄝ ㄍㄜ ㄍㄜˊ ㄍㄜˇ ㄍㄜˋ ㄍㄜ˙ ㄎㄜ ㄎㄜˊ ㄎㄜˇ ㄎㄜˋ ㄎㄜ˙ ㄝ ㄎ ㄜ ㄌ ㄛ ㄍ↵"},
                    {id:"1-5-7", name:"基礎注音", name2:" ㄚ" , name3:"", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ㄚ ㄚㄚ ㄚㄚㄚ ㄚˊ ㄚˇ ㄚˋ ㄚ˙ ㄚㄚㄚ ㄚㄚ ㄚ↵"},
                    {id:"1-5-8", name:"階段驗收", name2:" ㄎ ㄜ ㄌ ㄝ ㄍ ㄛ ㄚ" , name3:"", type:"注音練習", level:"☆☆☆☆☆★★", target:"ㄎ ㄜ ㄌ ㄝ ㄍ ㄛ ㄚ ㄎㄚ ㄎㄚˊ ㄎㄚˇ ㄎㄚˋ ㄌㄚ ㄌㄚˊ ㄌㄚˇ ㄌㄚˋ ㄎㄜ ㄎㄜˊ ㄎㄜˇ ㄎㄜˋ ㄎㄜ˙ ㄍㄜ ㄍㄜˊ ㄍㄜˇ ㄍㄜˋ ㄍㄜ˙ ㄎㄜㄝ ㄍㄌㄚ↵"},
                    {id:"1-5-9", name:"章節驗收", name2:" - 1-5" , name3:"", type:"注音練習", level:"☆☆☆☆★★★", target:"ㄍㄜ ㄍㄜ ↵ㄐㄧㄝˇㄐㄧㄝˇ↵ㄒㄧ ㄍㄨㄚ↵ㄖˋㄗ˙↵ㄧ ㄐㄩˋ↵ㄘˋㄕㄚ↵ㄗ ㄕˋ↵ㄔㄨ ㄕˋ↵ ㄕˋㄌㄧˋ↵ ㄖˋㄌㄧˋ↵ㄏㄨ ㄒㄧ↵ ㄍㄨㄛˋㄑㄩˋ↵ㄔㄨ ㄐㄧˊ↵ㄒㄧˇㄔㄜ ↵ㄒㄧㄚˊㄘ↵ㄘˋㄕㄨˋ↵ㄩˇㄧ ↵ㄐㄩˇㄓㄨㄥˋ↵"}
                ]
                
                
            },
            {
                id : "1-6",
                name : "1-6 無名指",
                stage:[
                    {id:"1-6-1", name:"基礎注音", name2:" ㄋ ㄠ" , name3:"", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ㄋㄠ ㄋㄋㄠ ㄠㄋㄋ ㄠㄋㄠㄋ ㄋㄠㄋㄠ ㄋㄠㄠ ㄠㄋㄋ ↵"},
                    {id:"1-6-2", name:"階段驗收", name2:" ㄋ ㄠ" , name3:"", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ㄋ ㄠ ㄋㄠㄠ ㄠㄋㄋ ㄋㄠㄋ ㄠㄋㄠ↵ ㄋㄠㄋㄠ ↵ㄋㄠ↵"},
                    {id:"1-6-3", name:"基礎注音", name2:" ㄊ ㄟ" , name3:"", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ㄊㄟ ㄟㄊ ㄊㄟㄟ ㄟㄊㄊ ㄟㄊㄟㄊ ㄊㄟㄊㄟ ㄟㄊ ㄊㄟ↵"},
                    {id:"1-6-4", name:"階段驗收", name2:" ㄋ ㄠ ㄊ ㄟ" , name3:"", type:"注音練習", level:"☆☆☆☆☆★★", target:"ㄋ ㄠ ㄊ ㄟ ㄋㄠ ㄋㄠˊ ㄋㄠˇ ㄋㄠˋ ㄊㄠ ㄊㄠˊ ㄊㄠˇ ㄊㄠˋ ㄋㄟ ㄋㄟˊ ㄋㄟˇ ㄋㄟˋ ㄋㄠㄠ ㄊㄟ↵"},
                    {id:"1-6-5", name:"基礎注音", name2:" ㄉ ㄢ" , name3:"", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ㄉ ㄢ ㄉㄢ ㄢㄉ ㄉㄉㄢ ㄢㄢㄉ ㄉㄢ ㄉㄢˊ ㄉㄢˇ ㄉㄢˋ ㄉㄢ˙ ㄉㄢㄉ ㄢㄉㄢ↵"},
                    {id:"1-6-6", name:"階段驗收", name2:" ㄋ ㄠ ㄊ ㄟ ㄉ ㄢ" , name3:"", type:"注音練習", level:"☆☆☆☆☆★★", target:"ㄋ ㄠ ㄊ ㄟ ㄉ ㄢ↵ ㄋㄢ ㄋㄢˊ ㄊㄢˇ ㄊㄢˋ ㄉㄢˇ ㄢ↵ ㄋㄟ ㄋㄟˇ ㄋㄠ ㄊㄟ ㄉㄢ ㄠㄋ ㄟㄊ ㄢㄉ↵"},
                    {id:"1-6-7", name:"基礎注音", name2:" ㄞ ㄡ" , name3:"", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ㄞ ㄡ ↵ㄞㄡ ㄡㄞ ↵ㄞㄞㄡ ㄡㄞㄞ ㄞㄡㄞㄡ ㄡㄞㄡㄞ↵"},
                    {id:"1-6-8", name:"階段驗收", name2:" ㄋ ㄠ ㄊ ㄟ ㄉ ㄢ ㄞ ㄡ" , name3:"", type:"注音練習", level:"☆☆☆☆☆★★", target:"ㄋ ㄠ ㄊ ㄟ ㄉ ㄢ ㄞ ㄡ↵ㄊㄞˊ ㄋㄠˇ ㄉㄢ ㄊㄞˋ ㄉㄞˋ ㄋㄟˋ ㄉㄟˇ ㄋㄞˋ ㄋㄠ ㄊㄟ ㄉㄢ ㄞㄡ ㄉㄟㄋ ㄡㄞㄊ ㄠㄞㄋ ㄋㄟㄉ↵"},
                    {id:"1-6-9", name:"章節驗收", name2:" - 1-6" , name3:"", type:"注音練習", level:"☆☆☆☆★★★", target:"ㄒㄧ ㄍㄨㄚ ↵ㄐㄧ ㄉㄢˋ↵ㄧㄡˊㄩˊ↵ㄧ ㄈㄨˊ↵ㄑㄧˋㄔㄜ ↵ㄖˋㄌㄧˋ↵ㄏㄞˊㄗ˙↵ㄕˋㄌㄧˋㄧㄢˇ↵ㄒㄧㄚˊㄘ ↵ㄕˊㄧ ㄩㄝˋ↵ㄐㄧ ㄑㄧˋㄖㄣˊ↵ㄐㄩˇㄑㄧˇ↵ㄍㄜ ㄍㄜ ↵ㄐㄧㄝˊㄍㄨㄚ ↵"}
                ]

                
            },
            {
                id : "1-7",
                name : "1-7 小拇指",
                stage:[
                    {id:"1-7-1", name:"基礎注音", name2:" ㄇ ㄤ" , name3:"", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ㄇ ㄤ ㄇㄇㄤ ㄤㄤㄇ ㄇㄤㄇㄤ ㄤㄇㄤㄇ ㄤㄤㄇ ㄇㄤㄤ ㄇㄤ ㄇㄤˊ ㄇㄤˇ ㄇㄤˋ↵"},
                    {id:"1-7-2", name:"階段驗收", name2:" ㄇ ㄤ" , name3:"", type:"注音練習", level:"☆☆☆☆☆☆☆", target:"ㄇㄇㄇㄇㄇㄇㄇㄇㄇㄇㄇㄇㄇㄇㄇㄇㄇㄇㄤㄤㄤㄤㄤㄤㄤㄤㄤㄤㄤㄤㄤㄤㄤㄤㄤㄤ↵↵↵↵↵↵↵↵↵↵↵↵↵↵↵↵↵↵"},
                    {id:"1-7-3", name:"基礎注音", name2:" ㄆ ㄣ" , name3:"", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ㄆ ㄣ ㄆㄣ ㄣㄆ ㄆㄆㄣ ㄣㄆㄆ ㄆㄣ ㄆㄣˊ ㄆㄣˇ ㄆㄣˋ ㄆㄣ˙ ㄆㄣㄆㄣ ㄣㄆ↵"},
                    {id:"1-7-4", name:"階段驗收", name2:" ㄇ ㄤ ㄆ ㄣ" , name3:"", type:"注音練習", level:"☆☆☆☆☆★★", target:"ㄇ ㄤ ㄆ ㄣ  ㄇㄣ ㄤㄇ ㄣㄆ ㄇㄇㄤ ㄤㄣㄣ ㄣㄣㄆ ㄆㄣ ㄇㄤˊ ㄆㄤˇ ㄇㄣˋ↵"},
                    {id:"1-7-5", name:"基礎注音", name2:" ㄅ ㄦ" , name3:"", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ㄅ ㄦ ㄅㄦ ㄅㄦ ㄅㄦㄦ ㄦㄅㄅ ㄦㄅㄦㄅ ㄅㄦㄅㄦ ㄦ ㄦˊ ㄦˇ ㄦˋ ㄅㄦ ㄦㄅ↵"},
                    {id:"1-7-6", name:"階段驗收", name2:" ㄇ ㄤ ㄆ ㄣ ㄅ ㄦ" , name3:"", type:"注音練習", level:"☆☆☆☆☆★★", target:"ㄇ ㄤ ㄆ ㄣ ㄅ ㄦ ㄅㄆ ㄦㄣ ㄇㄤ ㄇㄇㄤ ㄤㄤㄣ ㄣㄣㄦ ㄦㄦㄅ ㄅㄅㄆ ㄆㄆㄇ ㄅㄤ ㄇㄤˊ ㄆㄣˇ ㄇㄤˋ ㄆㄣ ㄆㄣˊ ㄆㄣˇ ㄆㄣˋ↵"},
                    {id:"1-7-7", name:"基礎注音", name2:" ㄈ ㄥ" , name3:"", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ㄈ ㄥ ㄈㄥㄥ ㄈㄈㄥㄥ ㄥㄥㄈㄈ ㄈㄈㄥ ㄥㄥㄈ ㄈㄥ ㄈㄥˊ ㄈㄥˇ ㄈㄥˋ ㄈㄥ˙↵"},
                    {id:"1-7-8", name:"階段驗收", name2:" ㄇ ㄤ ㄆ ㄣ ㄅ ㄦ ㄈ ㄥ" , name3:"", type:"注音練習", level:"☆☆☆☆☆★★", target:"ㄇ ㄤ ㄆ ㄣ ㄅ ㄦ ㄈ ㄥ ㄅㄆㄇㄈ ㄦㄣㄤㄥ ㄇㄤ ㄆㄣ ㄅㄦ ㄈㄥ ㄤㄤㄇㄇ ㄣㄣㄆㄆ ㄦㄦㄅㄅ ㄥㄥㄈㄈ ㄈㄥ ㄈㄥˊ ㄆㄣˊ ㄆㄣˇ ㄅㄣˇ ㄅㄣˋ ㄇㄤ ㄇㄤˊ ㄈㄥˇ ㄈㄥˋ ㄇㄤ˙ ㄅㄦㄆㄣ↵"},
                    {id:"1-7-9", name:"章節驗收", name2:" - 1-7" , name3:"", type:"注音練習", level:"☆☆☆☆★★★", target:"ㄈㄢˊㄊㄧˇㄓㄨㄥ ㄨㄣˊㄉㄚˇㄗˋㄓㄨㄥ ㄒㄧㄣ↵ㄊㄧˊㄍㄨㄥ ㄗㄨㄟˋㄒㄧㄤˊㄒㄧˋㄓㄨˋㄧㄣ ㄐㄧㄠ ㄒㄩㄝˊ↵ㄓㄨˇㄉㄚˇㄘㄨㄥˊㄓˇㄈㄚˇㄎㄞ ㄕˇㄌㄧㄢˋㄑㄧˇ↵ㄍㄨㄥ ㄒㄧˇㄋㄧˇㄐㄧˊㄐㄧㄤ ㄐㄧㄣˋㄖㄨˋㄓㄨㄥ ㄐㄧˊ↵"}
                ]

                
            },
            {
                id : "1-8",
                name : "1-8 常用符號",
                stage:[
                    {id:"1-8-1", name:"基礎符號", name2:" ，。" , name3:"逗號以及句號記得都要按住 ''shift'' 鍵才會打出來喔 (shift+ㄝ shift+ㄡ）", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ㄇㄟˇㄊㄧㄢ ㄉㄚˇㄗˋㄕˊㄈㄣ ㄓㄨㄥ ，ㄖˋㄐㄧ ㄩㄝˋㄌㄟˇㄐㄧㄢˋㄑㄧˊㄍㄨㄥ 。"},
                    {id:"1-8-2", name:"階段驗收", name2:" ，。" , name3:"", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ㄒㄧㄤˇㄧㄠˋㄉㄚˇㄗˋㄎㄨㄞˋ，ㄒㄧㄢ ㄇㄢˋㄒㄧㄚˋㄌㄞˊㄘㄞˊㄏㄨㄟˋㄎㄨㄞˋ↵"},
                    {id:"1-8-3", name:"基礎符號", name2:" ？！" , name3:"這種常用標點符號一定要記熟喔～", type:"注音練習", level:"☆☆☆☆☆★★", target:"ㄉㄚˇㄗˋㄎㄨㄞˋㄉㄜ˙ㄇㄧˋㄐㄩㄝˊㄉㄠˋㄉㄧˇㄕˋㄕㄣˊㄇㄛ˙？ㄐㄧㄢ ㄔˊㄇㄟˇㄊㄧㄢ ㄌㄧㄢˋㄒㄧˊ，ㄗㄨㄥˇㄧㄡˇㄧˋㄊㄧㄢ ㄏㄨㄟˋㄔㄥˊㄍㄨㄥ ！"},
                    {id:"1-8-4", name:"階段驗收", name2:" ，。？！" , name3:"", type:"注音練習", level:"☆☆☆☆☆★★", target:"ㄏㄞˊㄗㄞˋㄏㄞˋㄆㄚˋㄉㄚˇㄘㄨㄛˋㄗˋ？ㄩㄥˇㄍㄢˇㄢˋㄒㄧㄚˋㄑㄩˋ！ㄓˇㄧㄡˇㄘㄨㄛˇㄨˋㄋㄥˊㄗㄠˋㄐㄧㄡˋㄐㄧㄣˋㄅㄨˋ。"},
                    {id:"1-8-5", name:"基礎符號", name2:" （）" , name3:"", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ㄉㄚˇㄗˋㄕˊ（ㄧㄡˊㄑㄧˊㄕˋㄒㄧㄣ ㄕㄡˇ）ㄖㄨㄥˊㄧˋㄐㄧㄣˇㄓㄤ ，ㄓㄜˋㄨㄢˊㄑㄩㄢˊㄕˋㄓㄥˋㄔㄤˊㄉㄜ˙↵"},
                    {id:"1-8-6", name:"階段驗收", name2:" ，。？！（）" , name3:"", type:"注音練習", level:"☆☆☆☆☆★★", target:"ㄋㄧˇㄌㄟˋㄌㄜ˙ㄇㄚ ？ㄒㄧㄡ ㄒㄧˊㄧˊㄒㄧㄚˋ（ㄏㄜ ㄎㄡˇㄕㄨㄟˇ）ㄗㄞˋㄐㄧˋㄒㄩˋ！ㄐㄧㄢ ㄔˊㄌㄧㄢˋㄒㄧˊ（ㄋㄚˇㄆㄚˋㄓˇㄧㄡˇㄕˊㄈㄣ ㄓㄨㄥ ），ㄋㄧˇㄏㄨㄟˋㄎㄢˋㄐㄧㄢˋㄗˋㄐㄧˇㄉㄜ˙ㄐㄧㄣˋㄅㄨˋ。↵"},
                    {id:"1-8-7", name:"基礎符號", name2:" 、：" , name3:"", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ㄨㄣˇㄉㄧㄥˋㄉㄨˋ、ㄓˇㄈㄚˇ、ㄓㄨㄢ ㄓㄨˋㄌㄧˋ、ㄙㄨˋㄉㄨˋ、ㄒㄧㄣ ㄊㄞˋ：ㄇㄟˇㄒㄧㄤˋㄉㄡ ㄑㄩㄝ ㄧ ㄅㄨˋㄎㄜˇ↵"},
                    {id:"1-8-8", name:"階段驗收", name2:" ，。？！（）、：" , name3:"", type:"注音練習", level:"☆☆☆☆☆★★", target:"ㄅㄧㄝˊㄒㄧㄠˇㄎㄢˋㄇㄟˇㄧˊㄘˋㄌㄧㄢˋㄒㄧˊ（ㄋㄚˇㄆㄚˋㄓˇㄧㄡˇㄨˇㄈㄣ ㄓㄨㄥ ）。ㄓˇㄧㄠˋㄇㄟˇㄊㄧㄢ ㄌㄧㄢˋㄒㄧˊ、ㄩㄥˇㄧㄡˇㄓㄥˋㄑㄩㄝˋㄉㄜ˙ㄒㄧㄣ ㄊㄞˋ，ㄧˊㄉㄧㄥˋㄎㄜˇㄧˇㄐㄧㄣˋㄅㄨˋ。ㄉㄚˇㄘㄨㄛˋㄗˋ？ㄇㄟˊㄍㄨㄢ ㄒㄧˋ！ㄒㄧㄚˋㄘˋㄒㄧㄠˇㄒㄧㄣ ㄧˋㄉㄧㄢˇㄐㄧㄡˋㄒㄧㄥˊ！↵"},
                    {id:"1-8-9", name:"基礎符號", name2:" 「」" , name3:"", type:"注音練習", level:"☆☆☆☆☆☆★", target:"ㄙㄨˊㄏㄨㄚˋㄕㄨㄛ ：「ㄔ ㄉㄜˊㄎㄨˇㄓㄨㄥ ㄎㄨˇ，ㄈㄤ ㄨㄟˊㄖㄣˊㄕㄤˋㄖㄣˊ」ㄓˇㄧㄠˋㄑㄧㄣˊㄐㄧㄚ ㄌㄧㄢˋㄒㄧˊ，ㄅㄧˋㄋㄥˊㄗㄞˋㄓㄨㄥˋㄖㄣˊㄓㄨㄥ ㄊㄨㄛ ㄧㄥˇㄦˊㄔㄨ↵"},
                    {id:"1-8-10", name:"階段驗收", name2:" ，。？！（）、：「」" , name3:"", type:"注音練習", level:"☆☆☆☆☆★★", target:"ㄐㄧㄠˋㄌㄧㄢˋㄕㄨㄛ：「ㄕㄡˊㄋㄥˊㄕㄥㄑㄧㄠˇ，ㄎㄠˋㄉㄜ˙ㄕˋㄇㄟˇㄊㄧㄢ ㄌㄟˇㄐㄧ，ㄐㄩㄝˊㄅㄨˋㄐㄧㄢ ㄉㄨㄢˋ（ㄅㄨˋㄕˋㄙㄢ ㄈㄣ ㄓㄨㄥ ㄖㄜˋㄉㄨˋ）。」ㄋㄧˇㄏㄞˊㄗㄞˋㄧㄡˊㄩˋㄇㄚ˙？ㄒㄧㄢˋㄗㄞˋㄐㄧㄡˋㄎㄞ ㄕˇㄒㄧㄥˊㄉㄨㄥˋㄅㄚ˙！↵"},
                    {id:"1-8-11", name:"章節驗收", name2:" - 1-8" , name3:"恭喜你即將從初級畢業！將來的路可不好走 如果你未達到中級標準不要氣餒 歡迎回來多加練習", type:"注音練習", level:"☆☆☆☆★★★", target:"ㄙㄨˊㄏㄨㄚˋㄕㄨㄛ ：「ㄉㄧ ㄕㄨㄟˇㄔㄨㄢ ㄕˊ，ㄈㄟ ㄧˊㄖˋㄓ ㄍㄨㄥ 。」ㄉㄚˇㄗˋㄧㄝˇㄕˋㄖㄨˊㄘˇ，ㄙㄨˋㄉㄨˋ、ㄓㄥˋㄑㄩㄝˋㄌㄩˋ、ㄨㄣˇㄉㄧㄥˋㄉㄨˋ（ㄑㄩㄝ ㄧ ㄅㄨˋㄎㄜˇ）ㄉㄡ ㄧㄠˋㄇㄢˋㄇㄢˋㄇㄛˊㄌㄧㄢˋ，ㄋㄧˇㄓㄨㄣˇㄅㄟˋㄏㄠˇㄌㄜ˙ㄇㄚ˙？ㄅㄧㄝˊㄗㄞˋㄧㄡˊㄩˋ，ㄉㄨㄥˋㄕㄡˇㄌㄧㄢˋㄒㄧˊㄐㄧㄡˋㄉㄨㄟˋㄌㄜ˙！↵"}
                ]

                
            }
        ]
    },
    medium : {
        chapter:[
            {
                id : "2-1",
                name :"2-1 中級門檻測試",
                stage: [
                    {id:"2-1-1", name : "精熟度測試", name2:"", name3:"", type:"綜合練習", level:"☆☆☆★★★★", target1:"歡迎來到中級難度，相信在這之前你已經有了紮實的基本功，指法也相當熟悉，假如你這篇練習結果連三十都沒有，那麼說明這難度並不適合你，請回到初級重新練習", target:"ㄏㄨㄢ ㄧㄥˊㄌㄞˊㄉㄠˋㄓㄨㄥ ㄐㄧˊㄋㄢˊㄉㄨˋ，ㄒㄧㄤ ㄒㄧㄣˋㄗㄞˋㄓㄜˋㄓ ㄑㄧㄢˊㄋㄧˇㄧˇㄐㄧㄥ ㄧㄡˇㄌㄜ˙ㄓㄚˊㄕˊㄉㄜ˙ㄐㄧ ㄅㄣˇㄍㄨㄥ ，ㄓˇㄈㄚˇㄧㄝˇㄒㄧㄤ ㄉㄤ ㄕㄡˊㄒㄧ ，ㄐㄧㄚˇㄖㄨˊㄋㄧˇㄓㄜˋㄆㄧㄢ ㄌㄧㄢˋㄒㄧˊㄐㄧㄝˊㄍㄨㄛˇㄌㄧㄢˊㄙㄢ ㄕˊㄉㄡ ㄇㄟˊㄧㄡˇ，ㄋㄚˋㄇㄛ˙ㄕㄨㄛ ㄇㄧㄥˊㄓㄜˋㄋㄢˊㄉㄨˋㄅㄧㄥˋㄅㄨˊㄕˋㄏㄜˊㄋㄧˇ，ㄑㄧㄥˇㄏㄨㄟˊㄉㄠˋㄔㄨ ㄐㄧˊㄔㄨㄥˊㄒㄧㄣ ㄌㄧㄢˋㄒㄧˊ"},
                    {id:"2-1-2", name : "精熟度測試", name2:"", name3:"", type:"綜合練習", level:"☆☆☆★★★★", target1:"厲害喔！看來你沒有被趕回初級班。既然指法已經難不倒你，第三關我們要開始測試你的「肌肉記憶」。這部分的文本會出現更多不常見的字母組合，專門專治手指打結。", target:"ㄌㄧˋㄏㄞˋㄛ ！ㄎㄢˋㄌㄞˊㄋㄧˇㄇㄟˊㄧㄡˇㄅㄟˋㄍㄢˇㄏㄨㄟˊㄔㄨ ㄐㄧˊㄅㄢ 。ㄐㄧˋㄖㄢˊㄓˇㄈㄚˇㄧˇㄐㄧㄥ ㄋㄢˊㄅㄨˊㄉㄠˇㄋㄧˇ，ㄉㄧˋㄙㄢ ㄍㄨㄢ ㄨㄛˇㄇㄣ˙ㄧㄠˋㄎㄞ ㄕˇㄘㄜˋㄕˋㄋㄧˇㄉㄜ˙「ㄐㄧ ㄖㄡˋㄐㄧˋㄧˋ」。ㄓㄜˋㄅㄨˋㄈㄣ ㄨㄣˊㄅㄣˇㄏㄨㄟˋㄔㄨ ㄒㄧㄢˋㄍㄥˋㄉㄨㄛ ㄅㄨˊㄔㄤˊㄐㄧㄢˋㄗˋㄇㄨˇㄗㄨˇㄏㄜˊ，ㄓㄨㄢ ㄇㄣˊㄓㄨㄢ ㄓˋㄕㄡˇㄓˇㄉㄚˇㄐㄧㄝˊ。"},
                    {id:"2-1-3", name : "精熟度測試", name2:"", name3:"", type:"綜合練習", level:"☆☆☆★★★★", target1:"恭喜你來到第三關！別擔心，我們不打算逼死你。這一關的重點是「不要偷看鍵盤」。只要你相信手指的記憶，穩穩地打完，速度自然會提升。這次的目標是三十五字，只要保持平常心，你絕對可以輕鬆過關！", target:"ㄍㄨㄥ ㄒㄧˇㄋㄧˇㄌㄞˊㄉㄠˋㄉㄧˋㄙㄢ ㄍㄨㄢ ！ㄅㄧㄝˊㄉㄢ ㄒㄧㄣ ，ㄨㄛˇㄇㄣ˙ㄅㄨˋㄉㄚˇㄙㄨㄢˋㄅㄧ ㄙˇㄋㄧˇ。ㄓㄜˋㄧˋㄍㄨㄢ ㄉㄜ˙ㄓㄨㄥˋㄉㄧㄢˇㄕˋ「ㄅㄨˊㄧㄠˋㄊㄡ ㄎㄢˋㄐㄧㄢˊㄆㄢˊ」。ㄓˇㄧㄠˋㄋㄧˇㄒㄧㄤ ㄒㄧㄣˋㄕㄡˇㄓˇㄉㄜ˙ㄐㄧˋㄧˋ，ㄨㄣˇㄨㄣˇㄉㄜ˙ㄉㄚˇㄨㄢˊ，ㄙㄨˋㄉㄨˋㄗˋㄖㄢˊㄏㄨㄟˋㄊㄧˊㄕㄥ 。ㄓㄜˋㄘˋㄉㄜ˙ㄇㄨˋㄅㄧㄠ ㄕˋㄙㄢ ㄕˊㄨˇㄗˋ，ㄓˇㄧㄠˋㄅㄠˇㄔˊㄆㄧㄥˊㄔㄤˊㄒㄧㄣ ，ㄋㄧˇㄐㄩㄝˊㄉㄨㄟˋㄎㄜˇㄧˇㄑㄧㄥ ㄙㄨㄥ ㄍㄨㄛˋㄍㄨㄢ ！"}

                ]
            },
            {
                id : "2-2",
                name : "2-2 跨越時空的漢字字模",
                stage: [
                    {
                        id:"2-2-1", 
                        name :"古早的漢字打字機", 
                        name2:"", 
                        name3:"", 
                        type:"綜合練習", 
                        level:"☆☆☆★★★★", 
                        target1:"以前的英文打字機只要二十幾鍵，但中文有幾萬個字。最早的中文打字機根本沒有鍵盤，而是一個裝滿幾千個鉛字的大活字盤。打字員要拿著一個機械吸盤，在密密麻麻的字海裡把字一個個撿出來，速度亟慢。", 
                        target:"ㄧˇㄑㄧㄢˊㄉㄜ˙ㄧㄥ ㄨㄣˊㄉㄚˇㄗˋㄐㄧ ㄓㄧˇㄧㄠˋㄦˋㄕˊㄐㄧˇㄐㄧㄢˋ，ㄉㄢˋㄓㄨㄥ ㄨㄣˊㄧㄡˇㄐㄧˇㄨㄢˋㄍㄜ˙ㄗˋ。ㄗㄨㄟˋㄗㄠˇㄉㄜ˙ㄓㄨㄥ ㄨㄣˊㄉㄚˇㄗˋㄐㄧ ㄍㄣ ㄅㄣˇㄇㄟˊㄧㄡˇㄐㄧㄢˋㄆㄢˊ，ㄦˊㄕˋㄧˊㄍㄜ˙ㄓㄨㄤ ㄇㄢˇㄐㄧˇㄑㄧㄢ ㄍㄜ˙ㄑㄧㄢ ㄗˋㄉㄜ˙ㄉㄚˋㄏㄨㄛˊㄗˋㄆㄢˊ。ㄉㄚˇㄗˋㄩㄢˊㄧㄠˋㄋㄚˊㄓㄜ˙ㄧˊㄍㄜ˙ㄐㄧ ㄒㄧㄝˋㄒㄧ ㄆㄢˊ，ㄗㄞˋㄇㄧˋㄇㄧˋㄇㄚˊㄇㄚˊㄉㄜ˙ㄗˋㄏㄞˇㄌㄧˇㄅㄚˇㄗˋㄧˊㄍㄜ˙ㄍㄜ˙ㄐㄧㄢˇㄔㄨ ㄌㄞˊ，ㄙㄨˋㄉㄨˋㄐㄧˊㄇㄢˋ。"
                    },
                    {
                        id:"2-2-2", 
                        name : "林語堂與明快打字機", 
                        name2:"", 
                        name3:"", 
                        type:"綜合練習", 
                        level:"☆☆☆★★★★", 
                        target1:"為了解決中文無法快速排版檢索的難題，著名的學者林語堂耗盡家產，於 1947 年發明了一台叫作「明快」的中文打字機。", 
                        target:"ㄨㄟˋㄌㄜ˙ㄐㄧㄝˇㄐㄩㄝˊㄓㄨㄥ ㄨㄣˊㄨˊㄈㄚˇㄎㄨㄞˋㄙㄨˋㄆㄞˊㄅㄢˇㄐㄧㄢˇㄙㄨㄛˇㄉㄜ˙ㄋㄢˊㄊㄧˊ，ㄓㄨˋㄇㄧㄥˊㄉㄜ˙ㄒㄩㄝˊㄓㄜˇㄌㄧㄣˊㄩˇㄊㄤˊㄏㄠˋㄐㄧㄣˋㄐㄧㄚ ㄔㄢˇ，ㄩˊㄧ ㄐㄧㄡˇㄙˋㄑㄧ ㄋㄧㄢˊㄈㄚ ㄇㄧㄥˊㄌㄜ˙ㄧˋㄊㄞˊㄐㄧㄠˋㄗㄨㄛˋ「ㄇㄧㄥˊㄎㄨㄞˋ」ㄉㄜ˙ㄓㄨㄥ ㄨㄣˊㄉㄚˇㄗˋㄐㄧ 。"
                    },
                    {
                        id:"2-2-3", 
                        name : "注音輸入法的誕生", 
                        name2:"", 
                        name3:"括號內的注音不需要打喔~", 
                        type:"綜合練習", 
                        level:"☆☆☆★★★★", 
                        target1:"他摒(ㄅㄧㄥˋ)棄了傳統的部首觀念，改用首創的「上下形檢字法」，將中文字拆成左上角和右下角的幾何筆形來編碼。這台打字機僅用 72 個按鍵，就能讓使用者透過鍵盤流暢地打出上萬個漢字，是中文資訊化發展史上巨大的突破。", 
                        target:"ㄊㄚ ㄅㄧㄥˋㄑㄧˋㄌㄜ˙ㄔㄨㄢˊㄊㄨㄥˇㄉㄜ˙ㄅㄨˋㄕㄡˇㄍㄨㄢ ㄋㄧㄢˋ，ㄍㄞˇㄩㄥˋㄕㄡˇㄔㄨㄤˋㄉㄜ˙「ㄕㄤˋㄒㄧㄚˋㄒㄧㄥˊㄐㄧㄢˇㄗˋㄈㄚˇ」，ㄐㄧㄤ ㄓㄨㄥ ㄨㄣˊㄗˋㄔㄞ ㄔㄥˊㄗㄨㄛˇㄕㄤˋㄐㄧㄠ ㄏㄢˋㄧㄡˋㄒㄧㄚˋㄐㄧㄠ ㄉㄜ˙ㄐㄧˇㄏㄜˊㄅㄧˇㄒㄧㄥˊㄌㄞˊㄅㄧㄢ ㄇㄚˇ。ㄓㄜˋㄊㄞˊㄉㄚˇㄗˋㄐㄧ ㄐㄧㄣˇㄩㄥˋ ㄑㄧ ㄕˊㄦˋㄍㄜ˙ㄢˋㄐㄧㄢˋ，ㄐㄧㄡˋㄋㄥˊㄖㄤˋㄕˇㄩㄥˋㄓㄜˇㄊㄡˋㄍㄨㄛˋㄐㄧㄢˋㄆㄢˊㄌㄧㄡˊㄔㄤˋㄉㄜ˙ㄉㄚˇㄔㄨ ㄕㄤˋㄨㄢˋㄍㄜ˙ㄏㄢˋㄗˋ，ㄕˋㄓㄨㄥ ㄨㄣˊㄗ ㄒㄩㄣˋㄏㄨㄚˋㄈㄚ ㄓㄢˇㄕˇㄕㄤˋㄐㄩˋㄉㄚˋㄉㄜ˙ㄊㄨˊㄆㄛˋ。"
                    },
                    {
                        id:"2-2-4", 
                        name : "打字機未量產的原因", 
                        name2:"", 
                        name3:"", 
                        type:"綜合練習", 
                        level:"☆☆☆★★★★", 
                        target1:"遺憾的是，由於當時中國爆發內戰，加上機器內部由多個旋轉齒輪構成，工藝極其複雜且製造成本過高，明快打字機最終未能成功量產。林語堂也因此幾乎破產，唯一的原型機隨之塵封失蹤。", 
                        target:"ㄧˊㄏㄢˋㄉㄜ˙ㄕˋ，ㄧㄡˊㄩˊㄉㄤ ㄕˊㄓㄨㄥ ㄍㄨㄛˊㄅㄠˋㄈㄚ ㄋㄟˋㄓㄢˋ，ㄐㄧㄚ ㄕㄤˋㄐㄧ ㄑㄧˋㄋㄟˋㄅㄨˋㄧㄡˊㄉㄨㄛ ㄍㄜ˙ㄒㄩㄢˊㄓㄨㄢˇㄔˇㄌㄨㄣˊㄍㄡˋㄔㄥˊ，ㄍㄨㄥ ㄧˋㄐㄧˊㄑㄧˊㄈㄨˋㄗㄚˊㄑㄧㄝˇㄓˋㄗㄠˋㄔㄥˊㄅㄣˇㄍㄨㄛˋㄍㄠ ，ㄇㄧㄥˊㄎㄨㄞˋㄉㄚˇㄗˋㄐㄧ ㄗㄨㄟˋㄓㄨㄥ ㄨㄟˋㄋㄥˊㄔㄥˊㄍㄨㄥ ㄌㄧㄤˋㄔㄢˇ。ㄌㄧㄣˊㄩˇㄊㄤˊㄧㄝˇㄧㄣ ㄘˇㄐㄧ ㄏㄨ ㄆㄛˋㄔㄢˇ，ㄨㄟˊㄧ ㄉㄜ˙ㄩㄢˊㄒㄧㄥˊㄐㄧ ㄙㄨㄟˊㄓ ㄔㄣˊㄈㄥ ㄕ ㄗㄨㄥ 。"
                    },
                    {
                        id:"2-2-5", 
                        name : "漢字打字機的結局", 
                        name2:"", 
                        name3:"", 
                        type:"綜合練習", 
                        level:"☆☆☆★★★★", 
                        target1:"直到二零二五年一月，這台失落了近八十年的傳奇打字機，才奇蹟般在美國紐約的一處地下室被後人意外清理出來，重新震撼了世界科技史學界。", 
                        target:"ㄓˊㄉㄠˋㄦˋㄌㄧㄥˊㄦˋㄨˇㄋㄧㄢˊㄧ ㄩㄝˋ，ㄓㄜˋㄊㄞˊㄕ ㄌㄨㄛˋㄌㄜ˙ㄐㄧㄣˋㄅㄚ ㄕˊㄋㄧㄢˊㄉㄜ˙ㄔㄨㄢˊㄑㄧˊㄉㄚˇㄗˋㄐㄧ ，ㄘㄞˊㄑㄧˊㄐㄧ ㄅㄢ ㄗㄞˋㄇㄟˇㄍㄨㄛˊㄋㄧㄡˇㄩㄝ ㄉㄜ˙ㄧˊㄔㄨˋㄉㄧˋㄒㄧㄚˋㄕˋㄅㄟˋㄏㄡˋㄖㄣˊㄧˋㄨㄞˋㄑㄧㄥ ㄌㄧˇㄔㄨ ㄌㄞˊ，ㄔㄨㄥˊㄒㄧㄣ ㄓㄣˋㄏㄢˋㄌㄜ˙ㄕˋㄐㄧㄝˋㄎㄜ ㄐㄧˋㄕˇㄒㄩㄝˊㄐㄧㄝˋ。"
                    }
                ]      
            },
            {
                id : "2-3",
                name : "2-3 柯蒂鍵盤百年演進",
                stage: [
                    {
                        id:"2-3-1", 
                        name :"QWERTY 鍵盤的效率迷思", 
                        name2:"", 
                        name3:"邊學打字，邊學歷史 一舉兩得", 
                        type:"綜合練習", 
                        level:"☆☆☆★★★★", 
                        target1:"我們現在常用的英文鍵盤，左上角的前六個字母按鍵常被稱為標準排列。這種排列是由美國發明家肖爾斯在西元一八七三年設計的。當時為了配合最早的機械打字機，這種設計刻意打亂了字母順序，並非為了提高打字速度。相反地，它是為了配合當時粗糙的機械連動結構，限制打字員的手速。", 
                        target:"ㄨㄛˇㄇㄣ˙ㄒㄧㄢˋㄗㄞˋㄔㄤˊㄩㄥˋㄉㄜ˙ㄧㄥ ㄨㄣˊㄐㄧㄢˋㄆㄢˊ，ㄗㄨㄛˇㄕㄤˋㄐㄧㄠˇㄉㄜ˙ㄑㄧㄢˊㄌㄧㄡˋㄍㄜ˙ㄗˋㄇㄨˇㄢˋㄐㄧㄢˋㄔㄤˊㄅㄟˋㄔㄥ ㄨㄟˊㄅㄧㄠ ㄓㄨㄣˇㄆㄞˊㄌㄧㄝˋ。ㄓㄜˋㄓㄨㄥˇㄆㄞˊㄌㄧㄝˋㄕˋㄧㄡˊㄇㄟˇㄍㄨㄛˊㄈㄚ ㄇㄧㄥˊㄐㄧㄚ ㄒㄧㄠ ㄦˇㄙ ㄗㄞˋㄒㄧ ㄩㄢˊㄧ ㄅㄚ ㄑㄧ ㄙㄢ ㄋㄧㄢˊㄕㄜˋㄐㄧˋㄉㄜ˙。ㄉㄤ ㄕˊㄨㄟˋㄌㄜ˙ㄆㄟˋㄏㄜˊㄗㄨㄟˋㄗㄠˇㄉㄜ˙ㄐㄧ ㄒㄧㄝˋㄉㄚˇㄗˋㄐㄧㄢˋㄆㄢˊ，ㄓㄜˋㄓㄨㄥˇㄕㄜˋㄐㄧˋㄎㄜˋㄧˋㄉㄚˇㄌㄨㄢˋㄌㄜ˙ㄗˋㄇㄨˇㄕㄨㄣˋㄒㄩˋ，ㄅㄧㄥˋㄈㄟ ㄨㄟˋㄌㄜ˙ㄊㄧˊㄍㄠ ㄉㄚˇㄗˋㄙㄨˋㄉㄨˋ。ㄒㄧㄤ ㄈㄢˇㄉㄜ˙，ㄊㄚ ㄕˋㄨㄟˋㄌㄜ˙ㄆㄟˋㄏㄜˊㄉㄤ ㄕˊㄘㄨ ㄘㄠ ㄉㄜ˙ㄐㄧ ㄒㄧㄝˋㄌㄧㄢˊㄉㄨㄥˋㄐㄧㄝˊㄍㄡˋ，ㄒㄧㄢˋㄓˋㄉㄚˇㄗˋㄩㄢˊㄉㄜ˙ㄕㄡˇㄙㄨˋ。"
                    },
                    {
                        id:"2-3-2", 
                        name : "防止卡鍵的物理力學結構", 
                        name2:"", 
                        name3:"色帶：長條狀、沾滿墨水的織帶（架在紙張的前面），按下按鍵時會將墨水壓到紙上", 
                        type:"綜合練習", 
                        level:"☆☆☆★★★★", 
                        target1:"早期的機械打字機採用重力與彈簧拉桿來敲擊色帶。如果打字速度太快，相鄰的字桿在空中很容易發生碰撞而卡在一起。於是設計者故意把英語中使用頻率最高且常連續出現的字母組合隔開，強迫手指在移動時拉長距離以降低速度，從根本上解決了機械卡鍵的難題。", 
                        target:"ㄗㄠˇㄑㄧˊㄉㄜ˙ㄐㄧ ㄒㄧㄝˋㄉㄚˇㄗˋㄐㄧ ㄘㄞˇㄩㄥˋㄓㄨㄥˋㄌㄧˋㄩˇㄊㄢˊㄏㄨㄤˊㄌㄚ ㄍㄢˇㄌㄞˊㄑㄧㄠ ㄐㄧˊㄙㄜˋㄉㄞˋ。ㄖㄨˊㄍㄨㄛˇㄉㄚˇㄗˋㄙㄨˋㄉㄨˋㄊㄞˋㄎㄨㄞˋ，ㄒㄧㄤ ㄌㄧㄣˊㄉㄜ˙ㄗˋㄍㄢˇㄗㄞˋㄎㄨㄥ ㄓㄨㄥ ㄏㄣˇㄖㄨㄥˊㄧˋㄈㄚ ㄕㄥ ㄆㄥˋㄓㄨㄤˋㄦˊㄎㄚˇㄗㄞˋㄧˋㄑㄧˇ。ㄩˊㄕˋㄕㄜˋㄐㄧˋㄓㄜˇㄍㄨˋㄧˋㄅㄚˇㄧㄥ ㄩˇㄓㄨㄥ ㄕˇㄩㄥˋㄆㄧㄣˊㄌㄩˋㄗㄨㄟˋㄍㄠ ㄑㄧㄝˇㄔㄤˊㄌㄧㄢˊㄒㄩˋㄔㄨ ㄒㄧㄢˋㄉㄜ˙ㄗˋㄇㄨˇㄗㄨˇㄏㄜˊㄍㄜˊㄎㄞ ，ㄑㄧㄤˊㄆㄛˋㄕㄡˇㄓˇㄗㄞˋㄧˊㄉㄨㄥˋㄕˊㄌㄚ ㄔㄤˊㄐㄩˋㄌㄧˊㄧˇㄐㄧㄤˋㄉㄧ ㄙㄨˋㄉㄨˋ，ㄘㄨㄥˊㄍㄣ ㄅㄣˇㄕㄤˋㄐㄧㄝˇㄐㄩㄝˊㄌㄜ˙ㄐㄧ ㄒㄧㄝˋㄎㄚˇㄐㄧㄢˋㄉㄜ˙ㄋㄢˊㄊㄧˊ。"
                    },
                    {
                        id:"2-3-3", 
                        name : "盲打比賽與商業壟斷", 
                        name2:"", 
                        name3:"", 
                        type:"綜合練習", 
                        level:"☆☆☆★★★★", 
                        target1:"既然這種排列限制了速度，為什麼還會流行呢。原因在於當時的打字機巨頭軍工廠，在商業推廣上開創了盲打比賽，並大量培訓只會使用這種鍵盤的打字員。透過專利授權與龐大的打字學校體系，這種標準迅速取得了商業上的壟斷地位，讓其他更有效率的排列在起跑點上就失去了競爭力。", 
                        target:"ㄐㄧˋㄖㄢˊㄓㄜˋㄓㄨㄥˇㄆㄞˊㄌㄧㄝˋㄒㄧㄢˋㄓˋㄌㄜ˙ㄙㄨˋㄉㄨˋ，ㄨㄟˋㄕㄣˊㄇㄜ˙ㄏㄞˊㄏㄨㄟˋㄌㄧㄡˊㄒㄧㄥˊㄋㄜ˙。ㄩㄢˊㄧㄣ ㄗㄞˋㄩˊㄉㄤ ㄕˊㄉㄜ˙ㄉㄚˇㄗˋㄐㄧ ㄐㄩˋㄊㄡˊㄐㄩㄣ ㄍㄨㄥ ㄔㄤˇ，ㄗㄞˋㄕㄤ ㄧㄝˋㄊㄨㄟ ㄍㄨㄤˇㄕㄤˋㄎㄞ ㄔㄨㄤˋㄌㄜ˙ㄇㄤˊㄉㄚˇㄅㄧˇㄙㄞˋ，ㄅㄧㄥˋㄉㄚˋㄌㄧㄤˋㄆㄟˊㄒㄩㄣˋㄓˇㄏㄨㄟˋㄕˇㄩㄥˋㄓㄜˋㄓㄨㄥˇㄐㄧㄢˋㄆㄢˊㄉㄜ˙ㄉㄚˇㄗˋㄩㄢˊ。ㄊㄡˋㄍㄨㄛˋㄓㄨㄢ ㄌㄧˋㄕㄡˋㄑㄩㄢˊㄩˇㄆㄤˊㄉㄚˋㄉㄜ˙ㄉㄚˇㄗˋㄒㄩㄝˊㄒㄧㄠˋㄒㄧˋㄊㄨㄥˇ，ㄓㄜˋㄓㄨㄥˇㄅㄧㄠ ㄓㄨㄣˇㄒㄩㄣˋㄙㄨˋㄑㄩˇㄉㄜˊㄌㄜ˙ㄕㄤ ㄧㄝˋㄕㄤˋㄉㄜ˙ㄌㄨㄥˇㄉㄨㄢˋㄉㄧˋㄨㄟˋ，ㄖㄤˋㄑㄧˊㄊㄚ ㄍㄥˋㄧㄡˇㄒㄧㄠˋㄌㄩˋㄉㄜ˙ㄆㄞˊㄌㄧㄝˋㄗㄞˋㄑㄧˇㄆㄠˇㄉㄧㄢˇㄕㄤˋㄐㄧㄡˋㄕ ㄑㄩˋㄌㄜ˙ㄐㄧㄥˋㄓㄥ ㄌㄧˋ。"
                    },
                    {
                        id:"2-3-4", 
                        name : "DVORAK 鍵盤的人體工學反擊", 
                        name2:"", 
                        name3:"", 
                        type:"綜合練習", 
                        level:"☆☆☆★★★★", 
                        target1:"到了西元一九三六年，德沃夏克博士運用了當時盛行的科學管理原理，設計出一款全新的德沃夏克效率鍵盤。他將最常用的常見母音與輔音全部集中在中間的主導列上，大幅減少手指跨列移動的距離。據統計，這種排列能有效降低手指的疲勞與關節傷害，在理想狀態下，打字效率能提升將近百分之三十以上。", 
                        target:"ㄉㄠˋㄌㄜ˙ㄒㄧ ㄩㄢˊㄧ ㄐㄧㄡˇㄙㄢ ㄌㄧㄡˋㄋㄧㄢˊ，ㄉㄜˊㄨㄛˋㄒㄧㄚˋㄎㄜˋㄅㄛˊㄕˋㄩㄣˋㄩㄥˋㄌㄜ˙ㄉㄤ ㄕˊㄕㄥˋㄒㄧㄥˊㄉㄜ˙ㄎㄜ ㄒㄩㄝˊㄍㄨㄢˇㄌㄧˇㄩㄢˊㄌㄧˇ，ㄕㄜˋㄐㄧˋㄔㄨ ㄧˋㄎㄨㄢˇㄑㄩㄢˊㄒㄧㄣ ㄉㄜ˙ㄉㄜˊㄨㄛˋㄒㄧㄚˋㄎㄜˋㄒㄧㄠˋㄌㄩˋㄐㄧㄢˋㄆㄢˊ。ㄊㄚ ㄐㄧㄤ ㄗㄨㄟˋㄔㄤˊㄩㄥˋㄉㄜ˙ㄔㄤˊㄐㄧㄢˋㄇㄨˇㄧㄣ ㄩˇㄈㄨˇㄧㄣ ㄑㄩㄢˊㄅㄨˋㄐㄧˊㄓㄨㄥ ㄗㄞˋㄓㄨㄥ ㄐㄧㄢ ㄉㄜ˙ㄓㄨˇㄉㄠˇㄌㄧㄝˋㄕㄤˋ，ㄉㄚˋㄈㄨˊㄐㄧㄢˇㄕㄠˇㄕㄡˇㄓˇㄎㄨㄚˋㄌㄧㄝˋㄧˊㄉㄨㄥˋㄉㄜ˙ㄐㄩˋㄌㄧˊ。ㄐㄩˋㄊㄨㄥˇㄐㄧˋ，ㄓㄜˋㄓㄨㄥˇㄆㄞˊㄌㄧㄝˋㄋㄥˊㄧㄡˇㄒㄧㄠˋㄐㄧㄤˋㄉㄧ ㄕㄡˇㄓˇㄉㄜ˙ㄆㄧˊㄌㄠˊㄩˇㄍㄨㄢ ㄐㄧㄝˊㄕㄤ ㄏㄞˋ，ㄗㄞˋㄌㄧˇㄒㄧㄤˇㄓㄨㄤˋㄊㄞˋㄒㄧㄚˋ，ㄉㄚˇㄗˋㄒㄧㄠˋㄌㄩˋㄋㄥˊㄊㄧˊㄕㄥ ㄌㄜ˙ㄐㄧㄝˋㄐㄧㄣˋㄅㄞˇㄈㄣ ㄓ ㄙㄢ ㄕˊㄧˇㄕㄤˋ。"
                    },
                    {
                        id:"2-3-5", 
                        name : "效率打字法的遺憾結局", 
                        name2:"", 
                        name3:"", 
                        type:"綜合練習", 
                        level:"☆☆☆★★★★", 
                        target1:"雖然德沃夏克鍵盤在速度與人體工學上都完勝標準排列，但當時標準鍵盤已經全面普及。全世界的公司與秘書機構都已經習慣舊系統，更換設備與重新培訓人員的轉換成本實在太高。這項驚人的技術發明最終還是沒能改寫人類的打字習慣，在歷史上留下了著名的遺憾。", 
                        target:"ㄙㄨㄟ ㄖㄢˊㄉㄜˊㄨㄛˋㄒㄧㄚˋㄎㄜˋㄐㄧㄢˋㄆㄢˊㄗㄞˋㄙㄨˋㄉㄨˋㄩˇㄖㄣˊㄊㄧˇㄍㄨㄥ ㄒㄩㄝˊㄕㄤˋㄉㄡ ㄨㄢˊㄕㄥˋㄅㄧㄠ ㄓㄨㄣˇㄆㄞˊㄌㄧㄝˋ，ㄉㄢˋㄉㄤ ㄕˊㄅㄧㄠ ㄓㄨㄣˇㄐㄧㄢˋㄆㄢˊㄧˇㄐㄧㄥ ㄑㄩㄢˊㄇㄧㄢˋㄆㄨˇㄐㄧˊ。ㄑㄩㄢˊㄕˋㄐㄧㄝˋㄉㄜ˙ㄍㄨㄥ ㄙ ㄩˇㄇㄧˋㄕㄨ ㄐㄧ ㄍㄡˋㄉㄡ ㄧˇㄐㄧㄥ ㄒㄧˊㄍㄨㄢˋㄐㄧㄡˋㄒㄧˋㄊㄨㄥˇ，ㄍㄥ ㄏㄨㄢˋㄕㄜˋㄅㄟˋㄩˇㄔㄨㄥˊㄒㄧㄣ ㄆㄟˊㄒㄩㄣˋㄖㄣˊㄩㄢˊㄉㄜ˙ㄓㄨㄢˇㄏㄨㄢˋㄔㄥˊㄅㄣˇㄕˊㄗㄞˋㄊㄞˋㄍㄠ 。ㄓㄜˋㄒㄧㄤˋㄐㄧㄥ ㄖㄣˊㄉㄜ˙ㄐㄧˋㄕㄨˋㄈㄚ ㄇㄧㄥˊㄗㄨㄟˋㄓㄨㄥ ㄏㄞˊㄕˋㄇㄟˊㄋㄥˊㄍㄞˇㄒㄧㄝˇㄖㄣˊㄌㄟˋㄉㄜ˙ㄉㄚˇㄗˋㄒㄧˊㄍㄨㄢˋ，ㄗㄞˋㄌㄧˋㄕˇㄕㄤˋㄌㄧㄡˊㄒㄧㄚˋㄌㄜ˙ㄓㄨˋㄇㄧㄥˊㄉㄜ˙ㄧˊㄏㄢˋ。"
                    },
                    {
                        id:"2-3-6", 
                        name : "藍色巨人鍵盤標準化", 
                        name2:"", 
                        name3:"", 
                        type:"綜合練習", 
                        level:"☆☆☆★★★★", 
                        target1:"隨著電子計算機的發展，鍵盤不再只是打字的工具，更成為輸入指令的媒介。西元一九八四年，國際商業機器公司（藍色巨人）推出了經典的「一零一鍵標準電腦鍵盤架構」。這個標準正式將獨立的方向鍵、功能鍵與數字小鍵盤分離開來，雖然此時的電子科技早已擺脫了機械卡鍵的物理束縛，但這家科技龍頭依然選擇沿用了傳統的字母排列。", 
                        target:"ㄙㄨㄟˊㄓㄜ˙ㄉㄧㄢˋㄗˇㄐㄧˋㄙㄨㄢˋㄐㄧ ㄉㄜ˙ㄈㄚ ㄓㄢˇ，ㄐㄧㄢˋㄆㄢˊㄅㄨˊㄗㄞˋㄓˇㄕˋㄉㄚˇㄗˋㄉㄜ˙ㄍㄨㄥ ㄐㄩˋ，ㄍㄥˋㄔㄥˊㄨㄟˊㄕㄨ ㄖㄨˋㄓˇㄌㄧㄥˋㄉㄜ˙ㄇㄟˊㄐㄧㄝˋ。ㄒㄧ ㄩㄢˊㄧ ㄐㄧㄡˇㄅㄚ ㄙˋㄋㄧㄢˊ，ㄍㄨㄛˊㄐㄧˋㄕㄤ ㄧㄝˋㄐㄧ ㄑㄧˋㄍㄨㄥ ㄙ （ㄌㄢˊㄙㄜˋㄐㄩˋㄖㄣˊ）ㄊㄨㄟ ㄔㄨ ㄌㄜ˙ㄐㄧㄥ ㄉㄧㄢˇㄉㄜ˙「ㄧ ㄌㄧㄥˊㄧ ㄐㄧㄢˋㄅㄧㄠ ㄓㄨㄣˇㄉㄧㄢˋㄋㄠˇㄐㄧㄢˋㄆㄢˊㄐㄧㄚˋㄍㄡˋ」。ㄓㄜˋㄍㄜ˙ㄅㄧㄠ ㄓㄨㄣˇㄓㄥˋㄕˋㄐㄧㄤ ㄉㄨˊㄌㄧˋㄉㄜ˙ㄈㄤ ㄒㄧㄤˋㄐㄧㄢˋ、ㄍㄨㄥ ㄋㄥˊㄐㄧㄢˋㄩˇㄕㄨˋㄗˋㄒㄧㄠˇㄐㄧㄢˋㄆㄢˊㄈㄣ ㄌㄧˊㄎㄞ ，ㄙㄨㄟ ㄖㄢˊㄘˇㄕˊㄉㄜ˙ㄉㄧㄢˋㄗˇㄎㄜ ㄐㄧˋㄗㄠˇㄧˇㄅㄞˇㄊㄨㄛ ㄌㄜ˙ㄐㄧ ㄒㄧㄝˋㄗˋㄍㄢˇㄉㄜ˙ㄨˋㄌㄧˇㄕㄨˋㄈㄨˊ，ㄉㄢˋㄓㄜˋㄐㄧㄚ ㄎㄜ ㄐㄧˋㄌㄨㄥˊㄊㄡˊㄧ ㄖㄢˊㄒㄩㄢˇㄗㄜˊㄧㄢˊㄩㄥˋㄌㄜ˙ㄔㄨㄢˊㄊㄨㄥˇㄉㄜ˙ㄗˋㄇㄨˇㄆㄞˊㄌㄧㄝˋ。"
                    },
                    {
                        id:"2-3-7", 
                        name : "路徑依賴效應", 
                        name2:"", 
                        name3:"", 
                        type:"綜合練習", 
                        level:"☆☆☆★★★★", 
                        target1:"在經濟學與科技史上，英文鍵盤的演變是一個著名的路徑依賴案例。這個理論是指人類在面對技術選擇時，一旦做出決定並投入成本，就會像走上一條不歸路，後續的發展都會被限制在這條路徑上。即使後來出現了更優秀的技術，人們也因為龐大的既得利益與習慣，很難再回頭做修正，歷史的包袱戰勝了技術優勢。", 
                        target:"ㄗㄞˋㄐㄧㄥ ㄐㄧˋㄒㄩㄝˊㄩˇㄎㄜ ㄐㄧˋㄕˇㄕㄤˋ，ㄧㄥ ㄨㄣˊㄐㄧㄢˋㄆㄢˊㄉㄜ˙ㄧㄢˇㄅㄧㄢˋㄕˋㄧˊㄍㄜ˙ㄓˋㄇㄧㄥˊㄉㄜ˙ㄌㄨˋㄐㄧㄥˋㄧ ㄌㄞˋㄢˋㄌㄧˋ。ㄓㄜˋㄍㄜ˙ㄌㄧˇㄌㄨㄣˋㄕˋㄓˇㄖㄣˊㄌㄟˋㄗㄞˋㄇㄧㄢˋㄉㄨㄟˋㄐㄧˋㄕㄨˋㄒㄩㄢˇㄗㄜˊㄕˊ，ㄧˊㄉㄢˋㄗㄨㄛˋㄔㄨ ㄐㄩㄝˊㄉㄧㄥˋㄅㄧㄥˋㄊㄡˊㄖㄨˋㄔㄥˊㄅㄣˇ，ㄐㄧㄡˋㄏㄨㄟˋㄒㄧㄤˋㄗㄡˇㄕㄤˋㄧˋㄊㄧㄠˊㄅㄨˋㄍㄨㄟ ㄌㄨˋ，ㄏㄡˋㄒㄩˋㄉㄜ˙ㄈㄚ ㄓㄢˇㄉㄡ ㄏㄨㄟˋㄅㄟˋㄒㄧㄢˋㄓˋㄗㄞˋㄓㄜˋㄊㄧㄠˊㄌㄨˋㄐㄧㄥˋㄕㄤˋ。ㄐㄧˊㄕˇㄏㄡˋㄌㄞˊㄔㄨ ㄒㄧㄢˋㄌㄜ˙ㄍㄥˋㄧㄡ ㄒㄧㄡˋㄉㄜ˙ㄐㄧˋㄕㄨˋ，ㄖㄣˊㄇㄣ˙ㄧㄝˇㄧㄣ ㄨㄟˋㄆㄤˊㄉㄚˋㄉㄜ˙ㄐㄧˋㄉㄜˊㄌㄧˋㄧˋㄩˇㄒㄧˊㄍㄨㄢˋ，ㄏㄣˇㄋㄢˊㄗㄞˋㄏㄨㄟˊㄊㄡˊㄗㄨㄛˋㄒㄧㄡ ㄓㄥˋ，ㄌㄧˋㄕˇㄉㄜ˙ㄅㄠ ㄈㄨˊㄓㄢˋㄕㄥˋㄌㄜ˙ㄐㄧˋㄕㄨˋㄧㄡ ㄕˋ。"
                    },
                    {
                        id:"2-3-8", 
                        name : "觸控螢幕下的數位延續", 
                        name2:"", 
                        name3:"", 
                        type:"綜合練習", 
                        level:"☆☆☆★★★★", 
                        target1:"百年後的今天，我們進入了智慧型手機與智慧型裝置的時代。雖然玻璃螢幕上早已沒有任何機械字桿，我們甚至能透過語音辨識、滑行輸入或手勢進行高速溝通，但因為全球數十億人類根深蒂固的肌肉記憶，那個西元十九世紀為了防止卡鍵而設計的柯蒂排列，依然牢牢佔據著我們的觸控螢幕，繼續主宰數位世界。", 
                        target:"ㄅㄞˇㄋㄧㄢˊㄏㄡˋㄉㄜ˙ㄐㄧㄣ ㄊㄧㄢ ，ㄨㄛˇㄇㄣ˙ㄐㄧㄣˋㄖㄨˋㄌㄜ˙ㄓˋㄏㄨㄟˋㄒㄧㄥˊㄕㄡˇㄐㄧ ㄩˇㄓˋㄏㄨㄟˋㄒㄧㄥˊㄓㄨㄤ ㄓˋㄉㄜ˙ㄕˊㄉㄞˋ。ㄙㄨㄟˊㄖㄢˊㄅㄛ ㄌㄧˊㄧㄥˊㄇㄨˋㄕㄤˋㄗㄠˇㄧˇㄇㄟˊㄧㄡˇㄖㄣˋㄏㄜˊㄐㄧ ㄒㄧㄝˋㄗˋㄍㄢˇ，ㄨㄛˇㄇㄣ˙ㄕㄣˋㄓˋㄋㄥˊㄊㄡˋㄍㄨㄛˋㄩˇㄧㄣ ㄅㄧㄢˋㄕˋ、ㄏㄨㄚˊㄒㄧㄥˊㄕㄨ ㄖㄨˋㄏㄨㄛˋㄕㄡˇㄕˋㄐㄧㄣˋㄒㄧㄥˊㄍㄠ ㄙㄨˋㄍㄡ ㄊㄨㄥ ，ㄉㄢˋㄧㄣ ㄨㄟˋㄑㄩㄢˊㄑㄧㄡˊㄕㄨˋㄕˊㄧˋㄖㄣˊㄌㄟˋㄍㄣ ㄕㄣ ㄉㄧˋㄍㄨˋㄉㄜ˙ㄐㄧ ㄖㄡˋㄐㄧˋㄧˋ，ㄋㄚˋㄍㄜ˙ㄒㄧ ㄩㄢˊㄕˊㄐㄧㄡˇㄕˋㄐㄧˋㄨㄟˋㄌㄜ˙ㄈㄤˊㄓˇㄐㄧ ㄒㄧㄝˋㄎㄚˇㄐㄧㄢˋㄦˊㄕㄜˋㄐㄧˋㄉㄜ˙ㄎㄜ ㄉㄧˋㄆㄞˊㄌㄧㄝˋ，ㄧ ㄖㄢˊㄌㄠˊㄌㄠˊㄓㄢˋㄐㄩˋㄓㄜ˙ㄨㄛˇㄇㄣ˙ㄉㄜ˙ㄔㄨˋㄎㄨㄥ ㄧㄥˊㄇㄨˋ，ㄐㄧˋㄒㄩˋㄓㄨˇㄗㄞˇㄕㄨˋㄨㄟˋㄕˋㄐㄧㄝˋ。"
                    }
                ]      
            },
            {
                id : "2-4",
                name : "2-4 改變世界的emoji😄",
                stage: [
                    {
                        id:"2-4-1", 
                        name :"顏文字與最早的微笑", 
                        name2:"", 
                        name3:"", 
                        type:"綜合練習", 
                        level:"☆☆☆★★★★", 
                        target1:"在智慧型手機誕生前，人類就嘗試在冰冷的螢幕上展現情緒。西元一九八二年，一位美國教授在電子佈告欄上，第一次輸入了冒號、橫線與右括號組成的微笑符號，這就是顏文字的起點。雖然這種表達方式非常簡陋，卻成功為原本單調的純文字世界，注入了充滿人情味的溫度。", 
                        target:"ㄗㄞˋㄓˋㄏㄨㄟˋㄒㄧㄥˊㄕㄡˇㄐㄧ ㄉㄢˋㄕㄥ ㄑㄧㄢˊ，ㄖㄣˊㄌㄟˋㄐㄧㄡˋㄔㄤˊㄕˋㄗㄞˋㄅㄧㄥ ㄌㄥˇㄉㄜ˙ㄧㄥˊㄇㄨˋㄕㄤˋㄓㄢˇㄒㄧㄢˋㄑㄧㄥˊㄒㄩˋ。ㄒㄧ ㄩㄢˊㄧ ㄐㄧㄡˇㄅㄚ ㄦˋㄋㄧㄢˊ，ㄧˊㄨㄟˋㄇㄟˇㄍㄨㄛˊㄐㄧㄠˋㄕㄡˋㄗㄞˋㄉㄧㄢˋㄗˇㄅㄨˋㄍㄠˋㄌㄢˊㄕㄤˋ，ㄉㄧˋㄧ ㄘˋㄕㄨ ㄖㄨˋㄌㄜ˙ㄇㄠˋㄏㄠˋ、ㄏㄥˊㄒㄧㄢˋㄩˇㄧㄡˋㄍㄨㄚ ㄏㄠˋㄗㄨˇㄔㄥˊㄉㄜ˙ㄨㄟˊㄒㄧㄠˋㄈㄨˊㄏㄠˋ，ㄓㄜˋㄐㄧㄡˋㄕˋㄧㄢˊㄨㄣˊㄗˋㄉㄜ˙ㄑㄧˇㄉㄧㄢˇ。ㄙㄨㄟ ㄖㄢˊㄓㄜˋㄓㄨㄥˇㄅㄧㄠˇㄉㄚˊㄈㄤ ㄕˋㄈㄟ ㄔㄤˊㄐㄧㄢˇㄌㄡˋ，ㄑㄩㄝˋㄔㄥˊㄍㄨㄥ ㄨㄟˋㄩㄢˊㄅㄣˇㄉㄢ ㄉㄧㄠˋㄉㄜ˙ㄔㄨㄣˊㄨㄣˊㄗˋㄕˋㄐㄧㄝˋ，ㄓㄨˋㄖㄨˋㄌㄜ˙ㄔㄨㄥ ㄇㄢˇㄖㄣˊㄑㄧㄥˊㄨㄟˋㄉㄜ˙ㄨㄣ ㄉㄨˋ。"
                    },
                    {
                        id:"2-4-2", 
                        name :"簡訊省字數的救星", 
                        name2:"", 
                        name3:"", 
                        type:"綜合練習", 
                        level:"☆☆☆★★★★", 
                        target1:"西元一九九九年，日本一家電信公司的工程師栗田穰崇，為了解決簡訊字數受限的難題，設計出了一套全新圖案。他從日本漫畫與漢字中獲得靈感，在紙上畫出了世界上第一批只有一百七十六個的表情符號。這些原本用來節省簡訊字數的簡陋草稿，在不知不覺中改變了全球人類的溝通模式。", 
                        target:"ㄒㄧ ㄩㄢˊㄧ ㄐㄧㄡˇㄐㄧㄡˇㄐㄧㄡˇㄋㄧㄢˊ，ㄖˋㄅㄣˇㄧˋㄐㄧㄚ ㄉㄧㄢˋㄒㄧㄣ ㄍㄨㄥ ㄙ ㄉㄜ˙ㄍㄨㄥ ㄔㄥˊㄕˋㄌㄧˋㄊㄧㄢˊㄖㄤˊㄔㄨㄥˊ，ㄨㄟˋㄌㄜ˙ㄐㄧㄝˇㄐㄩㄝˊㄐㄧㄢˇㄒㄩㄣˋㄗˋㄕㄨˋㄕㄡˋㄒㄧㄢˋㄉㄜ˙ㄋㄢˊㄊㄧˊ，ㄕㄜˋㄐㄧˋㄔㄨ ㄌㄜ˙ㄧˊㄊㄠˋㄑㄩㄢˊㄒㄧㄣ ㄊㄨˊㄢˋ。ㄊㄚ ㄘㄨㄥˊㄖˋㄅㄣˇㄇㄢˋㄏㄨㄚˋㄩˇㄏㄢˋㄗˋㄓㄨㄥ ㄏㄨㄛˋㄉㄜˊㄌㄧㄥˊㄍㄢˇ，ㄗㄞˋㄓˇㄕㄤˋㄏㄨㄚˋㄔㄨ ㄌㄜ˙ㄕˋㄐㄧㄝˋㄕㄤˋㄉㄧˋㄧ ㄘˋㄓˇㄧㄡˇㄧˋㄅㄞˇㄑㄧ ㄕˊㄌㄧㄡˋㄍㄜ˙ㄉㄜ˙ㄅㄧㄠˇㄑㄧㄥˊㄈㄨˊㄏㄠˋ。ㄓㄜˋㄒㄧㄝ ㄩㄢˊㄅㄣˇㄩㄥˋㄌㄞˊㄐㄧㄝˊㄕㄥˇㄐㄧㄢˇㄒㄩㄣˋㄗˋㄕㄨˋㄉㄜ˙ㄐㄧㄢˇㄌㄡˋㄘㄠˇㄍㄠˇ，ㄗㄞˋㄅㄨˋㄓ ㄅㄨˋㄐㄩㄝˊㄓㄨㄥ ㄍㄞˇㄅㄧㄢˋㄌㄜ˙ㄑㄩㄢˊㄑㄧㄡˊㄖㄣˊㄌㄟˋㄉㄜ˙ㄍㄡ ㄊㄨㄥ ㄇㄛˊㄕˋ。"
                    },
                    {
                        id:"2-4-3", 
                        name :"亂碼橫飛的黑歷史", 
                        name2:"", 
                        name3:"", 
                        type:"綜合練習", 
                        level:"☆☆☆★★★★", 
                        target1:"隨著表情符號在日本大受歡迎，各大電信公司紛紛推出了自己設計的圖案。然而，由於當時缺乏統一的技術規格，每家公司的手機解碼方式都不一樣。這導致不同牌子的手機互相傳送貼圖時，螢幕上往往會出現一堆無法顯示的恐怖亂碼，這種科技混亂，差點毀了這個偉大發明的發展前途。", 
                        target:"ㄙㄨㄟˊㄓㄜ˙ㄅㄧㄠˇㄑㄧㄥˊㄈㄨˊㄏㄠˋㄗㄞˋㄖˋㄅㄣˇㄉㄚˋㄕㄡˋㄏㄨㄢ ㄧㄥˊ，ㄍㄜˋㄉㄚˋㄉㄧㄢˋㄒㄧㄣˋㄍㄨㄥ ㄙ ㄈㄣ ㄈㄣ ㄊㄨㄟ ㄔㄨ ㄌㄜ˙ㄗˋㄐㄧˇㄕㄜˋㄐㄧˋㄉㄜ˙ㄊㄨˊㄢˋ。ㄖㄢˊㄦˊ，ㄧㄡˊㄩˊㄉㄤ ㄕˊㄑㄩㄝ ㄈㄚˊㄊㄨㄥˇㄧ ㄉㄜ˙ㄐㄧˋㄕㄨˋㄍㄨㄟ ㄍㄜˊ，ㄇㄟˇㄐㄧㄚ ㄍㄨㄥ ㄙ ㄉㄜ˙ㄕㄡˇㄐㄧ ㄐㄧㄝˇㄇㄚˇㄈㄤ ㄕˋㄉㄡ ㄅㄨˋㄧˊㄧㄤˋ。ㄓㄜˋㄉㄠˇㄓˋㄅㄨˋㄊㄨㄥˊㄆㄞˊㄗ˙ㄉㄜ˙ㄕㄡˇㄐㄧ ㄏㄨˋㄒㄧㄤ ㄔㄨㄢˊㄙㄨㄥˋㄊㄧㄝ ㄊㄨˊㄕˊ，ㄧㄥˊㄇㄨˋㄕㄤˋㄨㄤˇㄨㄤˇㄏㄨㄟˋㄔㄨ ㄒㄧㄢˋㄧˋㄉㄨㄟ ㄨˊㄈㄚˇㄒㄧㄢˇㄕˋㄉㄜ˙ㄎㄨㄥˇㄅㄨˋㄌㄨㄢˋㄇㄚˇ，ㄓㄜˋㄓㄨㄥˇㄎㄜ ㄐㄧˋㄏㄨㄣˋㄌㄨㄢˋ，ㄔㄚ ㄉㄧㄢˇㄏㄨㄟˇㄌㄜ˙ㄓㄜˋㄍㄜ˙ㄨㄟˇㄉㄚˋㄈㄚ ㄇㄧㄥˊㄉㄜ˙ㄈㄚ ㄓㄢˇㄑㄧㄢˊㄊㄨˊ。"
                    },
                    {
                        id:"2-4-4", 
                        name :"數位世界的聯合國", 
                        name2:"", 
                        name3:"", 
                        type:"綜合練習", 
                        level:"☆☆☆★★★★", 
                        target1:"為了解決滿螢幕亂碼的歷史危機，位於美國的萬國碼聯盟挺身而出。這個由科技巨頭組成的數位聯合國，決定將全球的表情符號納入統一的國際標準編碼。這意味著無論你使用的是什麼品牌的智慧型手機或電腦，世界另一端的人都能精準看懂同一個表情，正式開啟了無國界溝通的新頁。", 
                        target:"ㄨㄟˋㄌㄜ˙ㄐㄧㄝˇㄐㄩㄝˊㄇㄢˇㄧㄥˊㄇㄨˋㄌㄨㄢˋㄇㄚˇㄉㄜ˙ㄌㄧˋㄕˇㄨㄟˊㄐㄧ ，ㄨㄟˋㄩˊㄇㄟˇㄍㄨㄛˊㄉㄜ˙ㄨㄤˋㄍㄨㄛˊㄇㄚˇㄌㄧㄢˊㄇㄥˊㄊㄧㄥˇㄕㄣ ㄦˊㄔㄨ ㄢˇ。ㄓㄜˋㄍㄜ˙ㄧㄡˊㄎㄜ ㄐㄧˋㄐㄩˋㄖㄣˊㄗㄨˇㄔㄥˊㄉㄜ˙ㄕㄨˋㄨㄟˋㄌㄧㄢˊㄏㄜˊㄍㄨㄛˊ，ㄐㄩㄝˊㄉㄧㄥˋㄐㄧㄤ ㄑㄩㄢˊㄑㄧㄡˊㄉㄜ˙ㄅㄧㄠˇㄑㄧㄥˊㄈㄨˊㄏㄠˋㄋㄚˋㄖㄨˋㄊㄨㄥˇㄧ ㄉㄜ˙ㄍㄨㄛˊㄐㄧˋㄅㄧㄠ ㄓㄨㄣˇㄅㄧㄢ ㄇㄚˇ。ㄓㄜˋㄧˋㄨㄟˋㄓㄜ˙ㄨˊㄌㄨㄣˋㄋㄧˇㄕˇㄩㄥˋㄉㄜ˙ㄕˋㄕㄣˊㄇㄜ˙ㄆㄧㄣˇㄆㄞˊㄉㄜ˙ㄓˋㄏㄨㄟˋㄒㄧㄥˊㄕㄡˇㄐㄧ ㄏㄨㄛˋㄉㄧㄢˋㄋㄠˇ，ㄕˋㄐㄧㄝˋㄌㄧㄥˋㄧ ㄉㄨㄢ ㄉㄜ˙ㄖㄣˊㄉㄡ ㄋㄥˊㄐㄧㄥ ㄓㄨㄣˇㄎㄢˋㄉㄨㄥˇㄊㄨㄥˊㄧ ㄍㄜ˙ㄅㄧㄠˇㄑㄧㄥˊ，ㄓㄥˋㄕˋㄎㄞ ㄑㄧˇㄌㄜ˙ㄨˊㄍㄨㄛˊㄐㄧㄝˋㄍㄡ ㄊㄨㄥ ㄉㄜ˙ㄒㄧㄣ ㄧㄝˋ。"
                    },
                    {
                        id:"2-4-5", 
                        name :"全球演算法的選拔賽", 
                        name2:"", 
                        name3:"", 
                        type:"綜合練習", 
                        level:"☆☆☆★★★★", 
                        target1:"雖然萬國碼聯盟統一了規格，但新圖案的增加卻極為嚴格。每年世界各地都有無數愛好者投稿自己設計的新貼圖，但必須通過重重篩選。評審團會根據使用頻率、是否具有全球共通性以及能否代表新文化等條件進行嚴格審查，每一款成功上線的貼圖，都像是通過了一場數位世界選拔賽。", 
                        target:"ㄙㄨㄟ ㄖㄢˊㄨㄤˋㄍㄨㄛˊㄇㄚˇㄌㄧㄢˊㄇㄥˊㄊㄨㄥˇㄧ ㄌㄜ˙ㄍㄨㄟ ㄍㄜˊ，ㄉㄢˋㄒㄧㄣ ㄊㄨˊㄢˋㄉㄜ˙ㄗㄥ ㄐㄧㄚ ㄑㄩㄝˋㄐㄧˊㄨㄟˊㄧㄢˊㄍㄜˊ。ㄇㄟˇㄋㄧㄢˊㄕˋㄐㄧㄝˋㄍㄜˋㄉㄧˋㄉㄡ ㄧㄡˇㄨˊㄕㄨˋㄞˋㄏㄠˋㄓㄜˇㄊㄡˊㄍㄠˇㄗˋㄐㄧˇㄕㄜˋㄐㄧˋㄉㄜ˙ㄒㄧㄣ ㄊㄧㄝ ㄊㄨˊ，ㄉㄢˋㄅㄧˋㄒㄩ ㄊㄡˋㄍㄨㄛˋㄔㄨㄥˊㄔㄨㄥˊㄕㄞ ㄒㄩㄢˇ。ㄆㄧㄥˊㄕㄣˇㄊㄨㄢˊㄏㄨㄟˋㄍㄣ ㄐㄩˋㄕˇㄩㄥˋㄆㄧㄣˊㄌㄩˋ、ㄕˋㄈㄡˇㄐㄩˋㄧㄡˇㄑㄩㄢˊㄑㄧㄡˊㄍㄨㄥˋㄊㄨㄥˊㄒㄧㄥˋㄧˇㄐㄧˊㄋㄥˊㄈㄡˇㄉㄞˋㄅㄧㄠˇㄒㄧㄣ ㄨㄣˊㄏㄨㄚˋㄉㄥˇㄊㄧㄠˊㄐㄧㄢˋㄐㄧㄣˋㄒㄧㄥˊㄧㄢˊㄍㄜˊㄕㄣ ㄔㄚˊ，ㄇㄟˇㄧ ㄎㄨㄢˇㄔㄥˊㄍㄨㄥ ㄕㄤˋㄒㄧㄢˋㄉㄜ˙ㄊㄧㄝ ㄊㄨˊ，ㄉㄡ ㄒㄧㄤˋㄕˋㄊㄡˋㄍㄨㄛˋㄌㄜ˙ㄧ ㄔㄤˊㄕㄨˋㄨㄟˋㄕˋㄐㄧㄝˋㄒㄩㄢˇㄅㄚˊㄙㄞˋ。"
                    },
                    {
                        id:"2-4-6", 
                        name :"台灣之光珍珠奶茶", 
                        name2:"", 
                        name3:"", 
                        type:"綜合練習", 
                        level:"☆☆☆★★★★", 
                        target1:"在眾多新圖案的全球選拔賽中，最讓台灣人驕傲的莫過於珍珠奶茶。一位台灣女孩親自向聯盟提交了厚厚的提案書，詳細闡述珍奶如何風靡全球並成為跨文化符號。歷經多年的漫長審核與多輪激烈辯論，珍珠奶茶終於在西元二零二零年正式成為國際標準圖案，成功把台灣美食文化印在全世界的手機裡。", 
                        target:"ㄗㄞˋㄓㄨㄥˋㄉㄨㄛ ㄒㄧㄣ ㄊㄨˊㄢˋㄉㄜ˙ㄑㄩㄢˊㄑㄧㄡˊㄒㄩㄢˇㄅㄚˊㄙㄞˋㄓㄨㄥ ，ㄗㄨㄟˋㄖㄤˋㄊㄞˊㄨㄢ ㄖㄣˊㄐㄧㄠ ㄠˋㄉㄜ˙ㄇㄛˋㄍㄨㄛˋㄩˊㄓㄣ ㄓㄨ ㄋㄞˇㄔㄚˊ。ㄧ ㄨㄟˋㄊㄞˊㄨㄢ ㄋㄩˇㄏㄞˊㄑㄧㄣ ㄗˋㄒㄧㄤˋㄌㄧㄢˊㄇㄥˊ㊊ˊㄐㄧㄠ ㄌㄜ˙ㄏㄡˋㄏㄡˋㄉㄜ˙ㄊㄧˊㄢˋㄕㄨ ，ㄒㄧㄤˊㄒㄧˋㄔㄢˇㄕㄨˋㄓㄣ ㄋㄞˇㄖㄨˊㄏㄨˊㄈㄥ ㄇㄧˊㄑㄩㄢˊㄑㄧㄡˊㄅㄧㄥˋㄔㄥˊㄨㄟˊㄎㄨㄚˋㄨㄣˊㄏㄨㄚˋㄈㄨˊㄏㄠˋ。ㄌㄧˋㄐㄧㄥ ㄉㄨㄛ ㄋㄧㄢˊㄉㄜ˙ㄇㄢˋㄔㄤˊㄕㄣ ㄔㄚˊㄩˇㄉㄨㄛ ㄌㄨㄣˊㄐㄧ ㄌㄧㄝˋㄅㄧㄢˋㄌㄨㄣˋ，ㄓㄣ ㄓㄨ ㄋㄞˇㄔㄚˊㄓㄨㄥ ㄩˊㄗㄞˋㄒㄧ ㄩㄢˊㄦˊㄌㄧㄥˊㄦˊㄌㄧㄥˊㄋㄧㄢˊㄓㄥˋㄕˋㄔㄥˊㄨㄟˊㄍㄨㄛˊㄐㄧˋㄅㄧㄠ ㄓㄨ恩 ㄊㄨˊㄢˋ，ㄔㄥˊㄍㄨㄥ ㄅㄚˇㄊㄞˊㄨㄢ ㄇㄟˇㄕˊㄨㄣˊㄏㄨㄚˋㄧㄣˋㄗㄞˋㄑㄩㄢˊㄕˋㄐㄧㄝˋㄉㄜ˙ㄕㄡˇㄐㄧ ㄌㄧˇ。"
                    },
                    {
                        id:"2-4-7", 
                        name :"文化偏見與多元包容", 
                        name2:"", 
                        name3:"", 
                        type:"綜合練習", 
                        level:"☆☆☆★★★★", 
                        target1:"隨著時代進步，表情符號也經歷了打破偏見的多元改革。早期的符號人物清一色都是黃色或單一膚色，且職業設定存在性別刻板印象。後來聯盟進行了重大革新，全面引入五種不同的膚色選項，並增加女性科學家、男護理師等多元職業。這些轉變讓世界各地、不同背景的人，都能在數位世界找到自我認同。", 
                        target:"ㄙㄨㄟˊㄓㄜ˙ㄕˊㄉㄞˋㄐㄧㄣˋㄅㄨˋ，ㄅㄧㄠˇㄑㄧㄥˊㄈㄨˊㄏㄠˋㄧㄝˇㄌㄧˋㄐㄧㄥ ㄌㄜ˙ㄉㄚˇㄆㄛˋㄆㄧㄢ ㄐㄧㄢˋㄉㄜ˙ㄉㄨㄛ ㄩㄢˊㄍㄞˇㄍㄜˊ。ㄗㄠˇㄑㄧˊㄉㄜ˙ㄈㄨˊㄏㄠˋㄖㄣˊㄨˋㄑㄧㄥ ㄧ ㄙㄜˋㄉㄡ ㄕˋㄏㄨㄤˊㄙㄜˋㄏㄨㄛˋㄉㄢ ㄧ ㄈㄨˇㄙㄜˋ，ㄑㄧㄝˇㄓˊㄧㄝˋㄕㄜˋㄉㄧㄥˋㄘㄨㄣˊㄗㄞˋㄒㄧㄥˋㄅㄧㄝˊㄎㄜˋㄅㄢˇㄧㄣˋㄒㄧㄤˋ。ㄏㄡˋㄌㄞˊㄌㄧㄢˊㄇㄥˊㄐㄧㄣˋㄒㄧㄥˊㄌㄜ˙ㄓㄨㄥˋㄉㄚˋㄍㄜˊㄒㄧㄣ ，ㄑㄩㄢˊㄇㄧㄢˋㄧㄣˇㄖㄨˋㄨˇㄓㄨㄥˇㄅㄨˋㄊㄨㄥˊㄉㄜ˙ㄈㄨˇㄙㄜˋㄒㄩㄢˇㄒㄧㄤˋ，ㄅㄧㄥˋㄗㄥ ㄐㄧㄚ ㄋㄩˇㄒㄧㄥˋㄎㄜ ㄒㄩㄝˊㄐㄧㄚ 、ㄋㄢˊㄏㄨˋㄌㄧˇㄕ ㄉㄥˇㄉㄨㄛ ㄩㄢˊㄓˊㄧㄝˋ。ㄓㄜˋㄒㄧㄝ ㄓㄨㄢˇㄅㄧㄢˋㄖㄤˋㄕˋㄐㄧㄝˋㄍㄜˋㄉㄧˋ、ㄅㄨˋㄊㄨㄥˊㄅㄟˋㄐㄧㄥˇㄉㄜ˙ㄖㄣˊ，ㄉㄡ ㄋㄥˊㄗㄞˋㄕㄨˋㄨㄟˋㄕˋㄐㄧㄝˋㄓㄠˇㄉㄠˋㄗˋㄨㄛˇㄖㄣˋㄊㄨㄥˊ。"
                    },
                    {
                        id:"2-4-8", 
                        name :"未來世界的全新語言", 
                        name2:"", 
                        name3:"", 
                        type:"綜合練習", 
                        level:"☆☆☆★★★★", 
                        target1:"到了今天，表情符號已經成為人類歷史上傳播速度最快、且完全打破隔閡的全球新文字。它不需要翻譯，就能跨越語言藩籬讓全世界心領神會。無論是藝術創作、法庭訴訟證據還是日常閒聊，這些小巧的圖案已經深度主宰了數位世界，繼續用它獨特的方式，書寫著人類歷史上全新的溝通篇章。", 
                        target:"ㄉㄠˋㄌㄜ˙ㄐㄧㄣ ㄊㄧㄢ ，ㄅㄧㄠˇㄑㄧㄥˊㄈㄨˊㄏㄠˋㄧˇㄐㄧㄥ ㄔㄥˊㄨㄟˊㄖㄣˊㄌㄟˋㄌㄧˋ...ㄕˇㄕㄤˋㄔㄨㄢˊㄅㄛ ㄙㄨˋㄉㄨˋㄗㄨㄟˋㄎㄨㄞˋ、ㄑㄧㄝˇㄑㄩㄢˊㄇㄧㄢˋㄉㄚˇㄆㄛˋㄍㄜˊㄏㄜˊㄉㄜ˙ㄑㄩㄢˊㄑィㄡˊㄒㄧㄣ ㄨㄣˊㄗˋ。ㄊㄚ ㄅㄨˋㄒㄩ ㄧㄠˋㄈㄢ ㄧˋ，ㄐㄧㄡˋㄋㄥˊㄎㄨㄚˋㄩㄝˋㄩˇㄧㄣ ㄈㄢˊㄌㄧˊㄖㄤˋㄑㄩㄢˊㄕˋㄐㄧㄝˋㄒㄧㄣ ㄌㄧˇㄕㄣˊㄏㄨㄟˋ。ㄨˊㄌㄨㄣˋㄕˋㄧˋㄕㄨˋㄔㄨㄤˋㄗㄨㄛˋ、ㄈㄚˇㄊㄧㄥˊㄙㄨˋㄙㄨㄥˋㄓㄥˋㄐㄩˋㄏㄞˊㄕˋㄖㄧˋㄔㄤˊㄒㄧㄢˊㄌㄧㄠˊ，ㄓㄜˋㄒㄧㄝ ㄒㄧㄠˇㄑㄧㄠˇㄉㄜ˙ㄊㄨˊㄢˋㄧˇㄐㄧㄥ ㄕㄣ ㄉㄨˋㄓㄨˇㄗㄞˇㄌㄜ˙ㄕㄨˋㄨㄟˋㄕˋㄐㄧㄝˋ，ㄐㄧˋㄒㄩˋㄩㄥˋㄊㄚ ㄉㄨˊㄊㄜˋㄉㄜ˙ㄈㄤ ㄕˋ，ㄕㄨ ㄒㄧㄝˇㄓㄜ˙ㄖㄣˊㄌㄟˋㄌㄧˋㄕˇㄕㄤˋㄑㄩㄢˊㄒㄧㄣ ㄉㄜ˙ㄍㄡ ㄊㄨㄥ ㄆㄧㄢ ㄓㄤ 。"
                    }
                ]      
            },
            {
                id: "2-3",
                name :"我們被制約的雙手",
                stage: [
                    {
                        id:"2-3-1",
                        name:"",
                        name2:"",
                        name3:"",
                        type: "綜合練習",
                        level:"☆☆☆★★★★",
                        target1:"",
                        target:""
                    },
                    {
                        id:"2-3-1",
                        name:"",
                        name2:"",
                        name3:"",
                        type: "綜合練習",
                        level:"☆☆☆★★★★",
                        target1:"",
                        target:""
                    },
                    {
                        id:"2-3-1",
                        name:"",
                        name2:"",
                        name3:"",
                        type: "綜合練習",
                        level:"☆☆☆★★★★",
                        target1:"",
                        target:""
                    }
                ]

            }
        ]
    },
    hard : {
        chapter:[
            {id : "3-1", name :"速度挑戰-1"}

        ]
    } 
}
function render_chapter(difficulty){
    const container = document.getElementById("chapter_list")
    const container_stage = document.getElementById("main_lobby_level_container")

    if(!container){
        console.log("沒找到chapter_list")
    }

    container_stage.innerHTML = ""
    container.innerHTML = ""      //清空

    Level_Data[difficulty].chapter.forEach(function(chapter){   //迴圈式建div
        const div = document.createElement("div")
        div.classList.add("chapter_frame")
        div.textContent = chapter.name

        div.addEventListener("click", function(){
            console.log("點了", chapter.name, chapter.id)
            select_chapter(div)
            render_stage(difficulty, chapter)
        })

        container.appendChild(div)
    })
}
function select_chapter(div){             //切章節 視覺部分
    const main_container = document.querySelectorAll(".chapter_frame")
    main_container.forEach(function(frame){
        frame.classList.remove("chapter_selected")
    })

    div.classList.add("chapter_selected")


}

function render_stage(difficulty, chapter){             //渲染關卡
    const single_container = document.getElementById("main_lobby_level_container")
    single_container.innerHTML = ""

    if(!chapter.stage){
        console.log("找不到該難度的關卡 難度：", difficulty)
        return
    }
    //讀檔json
    const progress = JSON.parse(localStorage.getItem("stage_progress")) || {}


    chapter.stage.forEach(function(stage){
        const div = document.createElement("div")

        div.classList.add("main_lobby_map_stage")
        div.innerHTML = `
                <div class="main_lobby_map_stage_text1">${stage.id}</div>
                <div class="main_lobby_map_stage_text2">
                    <p class="main_lobby_map_stage_text2-1">
                        -${stage.name}<span class="main_lobby_map_stage_text2-2">${stage.name2}</span>
                    </p>
                </div>
                <div class="main_lobby_map_stage_text3">${stage.type}</div>
                <div class="main_lobby_map_stage_difficulty_star">${stage.level}</div>
                `

        
        
        
        if(progress[stage.id] === true){
            div.innerHTML = `
                <div class="main_lobby_map_stage_text1">${stage.id}</div>
                <div class="main_lobby_map_stage_text2">
                    <p class="main_lobby_map_stage_text2-1">
                        -${stage.name}<span class="main_lobby_map_stage_text2-2">${stage.name2}</span>
                    </p>
                </div>
                <div class="main_lobby_map_stage_text3">${stage.type}</div>
                <div class="main_lobby_map_stage_difficulty_star">${stage.level}</div>
                
                <div style="
                position: absolute;

                padding: 4px 6px;
                right: 7px;
                bottom: 6px;

                font-size: 0.9rem;
                color: #c9a84c;
                
                border: 1px solid #c9a84c;
                border-radius: 3px;
                ">已完成</div>
                `
                div.style.backgroundColor = "rgba(220, 245, 220, 0.1)";
                div.style.borderLeft = "2px solid #c9a84c"
        }
        div.addEventListener("click", function(){
            window.location.href = `game.html?stage=${stage.id}`
        })
        single_container.appendChild(div)
    })
}

function get_difficulty_by_stageid(stage_id){
    const first_number = String(stage_id).charAt(0);

    if(first_number === "1"){return "easy"}
    if(first_number === "2"){return "medium"}
    if(first_number === "3"){return "hard"}

    return null;
}

function increase_stage_count(difficulty){

    const easy_btn = document.getElementById("mode_select_easy_btn")
    const medium_btn = document.getElementById("mode_select_medium_btn")
    const hard_btn = document.getElementById("mode_select_hard_btn")


    if(difficulty === "easy"){
        let easy_clear_stage_counter = Number(localStorage.getItem("easy_stage_counter")) || 0
        easy_clear_stage_counter += 1;
        localStorage.setItem("easy_stage_counter", easy_clear_stage_counter)

        if(Number(easy_clear_stage_counter) >= 60){
            const easy_btn = document.getElementById("mode_select_easy_btn");
            if (easy_btn){
                easy_btn.style.backgroundColor = "white";
            }
        }
    }
    else if(difficulty === "medium"){
        
    }
    else if(difficulty === "hard"){

    }
}